{
  "database": "arXiv",
  "search_date": "2026-02-06",
  "queries": {
    "primary": "(ti:\"single cell\" OR ti:scRNA OR ti:\"gene expression\" OR ti:transcriptomics OR abs:\"single-cell\" OR abs:\"RNA-seq\" OR abs:\"spatial transcriptomics\" OR abs:\"multi-omics\") AND (ti:\"language model\" OR ti:GPT OR ti:LLM OR ti:CLIP OR ti:multimodal OR abs:\"language model\" OR abs:\"large language model\" OR abs:\"natural language\" OR abs:\"cross-modal\" OR abs:\"multi-modal\") AND (abs:\"foundation model\" OR abs:pretrain OR abs:\"self-supervised\" OR abs:transformer OR abs:generative OR abs:decoder OR abs:autoregressive)",
    "cell_language": "abs:\"foundation model\" AND abs:\"single cell\" AND abs:\"language model\"",
    "model_names": "(ti:scGPT OR ti:tGPT OR ti:LangCell OR ti:ChatCell OR ti:GenePT OR ti:GeneGPT OR ti:CellPLM OR ti:Nicheformer OR ti:EpiAgent)",
    "bio_llm": "abs:\"gene expression\" AND abs:LLM AND (abs:generative OR abs:decoder OR abs:autoregressive)"
  },
  "filters": "submittedDate 2018-2026 (implicit in results)",
  "total_unique_results": 140,
  "records": [
    {
      "arxiv_id": "2602.01772v1",
      "doi": "",
      "title": "DIA-CLIP: a universal representation learning framework for zero-shot DIA proteomics",
      "abstract": "Data-independent acquisition mass spectrometry (DIA-MS) has established itself as a cornerstone of proteomic profiling and large-scale systems biology, offering unparalleled depth and reproducibility. Current DIA analysis frameworks, however, require semi-supervised training within each run for peptide-spectrum match (PSM) re-scoring. This approach is prone to overfitting and lacks generalizability across diverse species and experimental conditions. Here, we present DIA-CLIP, a pre-trained model",
      "authors": "Yucheng Liao; Han Wen; Weinan E; Weijie Zhang",
      "date": "2026-02-02",
      "year": "2026",
      "categories": [
        "cs.LG",
        "cs.AI",
        "q-bio.QM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2601.17138v2",
      "doi": "",
      "title": "AI Developments for T and B Cell Receptor Modeling and Therapeutic Design",
      "abstract": "Artificial intelligence (AI) is accelerating progress in modeling T and B cell receptors by enabling predictive and generative frameworks grounded in sequence data and immune context. This chapter surveys recent advances in the use of protein language models, machine learning, and multimodal integration for immune receptor modeling. We highlight emerging strategies to leverage single-cell and repertoire-scale datasets, and optimize immune receptor candidates for therapeutic design. These develop",
      "authors": "Linhui Xie; Aurelien Pelissier; Yanjun Shao; Maria Rodriguez Martinez",
      "date": "2026-01-23",
      "year": "2026",
      "categories": [
        "q-bio.BM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2601.15392v1",
      "doi": "https://doi.org/10.1007/978-3-032-11317-7_33",
      "title": "GeMM-GAN: A Multimodal Generative Model Conditioned on Histopathology Images and Clinical Descriptions for Gene Expression Profile Generation",
      "abstract": "Biomedical research increasingly relies on integrating diverse data modalities, including gene expression profiles, medical images, and clinical metadata. While medical images and clinical metadata are routinely collected in clinical practice, gene expression data presents unique challenges for widespread research use, mainly due to stringent privacy regulations and costly laboratory experiments. To address these limitations, we present GeMM-GAN, a novel Generative Adversarial Network conditione",
      "authors": "Francesca Pia Panaccione; Carlo Sgaravatti; Pietro Pinoli",
      "date": "2026-01-21",
      "year": "2026",
      "categories": [
        "cs.AI",
        "cs.CV",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2601.07163v2",
      "doi": "",
      "title": "Test-time Adaptive Hierarchical Co-enhanced Denoising Network for Reliable Multimodal Classification",
      "abstract": "Reliable learning of multimodal data (e.g., multi-omics) is a widely concerning issue, especially in safety-critical applications such as medical diagnosis. However, low-quality data induced by multimodal noise poses a major challenge in this domain, causing existing methods to suffer from two key limitations. First, they struggle to handle heterogeneous data noise, hindering robust multimodal representation learning. Second, they exhibit limited adaptability and generalization when encountering",
      "authors": "Shu Shen; C. L. Philip Chen; Tong Zhang",
      "date": "2026-01-12",
      "year": "2026",
      "categories": [
        "cs.CV"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2601.05648v1",
      "doi": "",
      "title": "Open World Knowledge Aided Single-Cell Foundation Model with Robust Cross-Modal Cell-Language Pre-training",
      "abstract": "Recent advancements in single-cell multi-omics, particularly RNA-seq, have provided profound insights into cellular heterogeneity and gene regulation. While pre-trained language model (PLM) paradigm based single-cell foundation models have shown promise, they remain constrained by insufficient integration of in-depth individual profiles and neglecting the influence of noise within multi-modal data. To address both issues, we propose an Open-world Language Knowledge-Aided Robust Single-Cell Found",
      "authors": "Haoran Wang; Xuanyi Zhang; Shuangsang Fang; Longke Ran; Ziqing Deng",
      "date": "2026-01-09",
      "year": "2026",
      "categories": [
        "q-bio.GN",
        "cs.AI",
        "cs.CL",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2512.24733v1",
      "doi": "",
      "title": "BIOME-Bench: A Benchmark for Biomolecular Interaction Inference and Multi-Omics Pathway Mechanism Elucidation from Scientific Literature",
      "abstract": "Multi-omics studies often rely on pathway enrichment to interpret heterogeneous molecular changes, but pathway enrichment (PE)-based workflows inherit structural limitations of pathway resources, including curation lag, functional redundancy, and limited sensitivity to molecular states and interventions. Although recent work has explored using large language models (LLMs) to improve PE-based interpretation, the lack of a standardized benchmark for end-to-end multi-omics pathway mechanism elucida",
      "authors": "Sibo Wei; Peng Chen; Lifeng Dong; Yin Luo; Lei Wang",
      "date": "2025-12-31",
      "year": "2025",
      "categories": [
        "cs.CL"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2512.09964v1",
      "doi": "",
      "title": "Development of an Agentic AI Model for NGS Downstream Analysis Targeting Researchers with Limited Biological Background",
      "abstract": "Next-Generation Sequencing (NGS) has become a cornerstone of genomic research, yet the complexity of downstream analysis-ranging from differential expression gene (DEG) identification to biological interpretations-remains a significant barrier for researchers lacking specialized computational and biological expertise. While recent studies have introduced AI agents for RNA-seq analysis, most focus on general workflows without offering tailored interpretations or guidance for novices. To address t",
      "authors": "Donghyeon Lee; Dongseok Kim; Seokhwan Ko; Seo-Young Park; Junghwan Cho",
      "date": "2025-12-10",
      "year": "2025",
      "categories": [
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2512.00306v1",
      "doi": "",
      "title": "VCWorld: A Biological World Model for Virtual Cell Simulation",
      "abstract": "Virtual cell modeling aims to predict cellular responses to perturbations. Existing virtual cell models rely heavily on large-scale single-cell datasets, learning explicit mappings between gene expression and perturbations. Although recent models attempt to incorporate multi-source biological information, their generalization remains constrained by data quality, coverage, and batch effects. More critically, these models often function as black boxes, offering predictions without interpretability",
      "authors": "Zhijian Wei; Runze Ma; Zichen Wang; Zhongmin Li; Shuotong Song",
      "date": "2025-11-29",
      "year": "2025",
      "categories": [
        "q-bio.CB",
        "cs.AI",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2511.21075v1",
      "doi": "",
      "title": "Aligning LLMs with Biomedical Knowledge using Balanced Fine-Tuning",
      "abstract": "Effective post-training is essential to align Large Language Models (LLMs) with specialized biomedical knowledge to accelerate life science research. However, current approaches face significant limitations. First, biomedical reasoning involves intricate mechanisms often represented by sparse textual data. Standard Supervised Fine-Tuning (SFT) tends to overfit to surface-level instruction patterns without effectively internalizing this fragmented scientific knowledge. Second, Reinforcement Learn",
      "authors": "Zhenchao Tang; Fang Wang; Haohuai He; Jiale Zhou; Tianxu Lv",
      "date": "2025-11-26",
      "year": "2025",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2511.20382v2",
      "doi": "",
      "title": "MoRE: Batch-Robust Multi-Omics Representations from Frozen Pre-trained Transformers",
      "abstract": "Representation learning on multi-omics data is challenging due to extreme dimensionality, modality heterogeneity, and cohort-specific batch effects. While pre-trained transformer backbones have shown broad generalization capabilities in biological sequence modeling, their application to multi-omics integration remains underexplored. We present MoRE (Multi-Omics Representation Embedding), a framework that repurposes frozen pre-trained transformers to align heterogeneous assays into a shared laten",
      "authors": "Audrey Pei-Hsuan Chen",
      "date": "2025-11-25",
      "year": "2025",
      "categories": [
        "cs.LG",
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2511.15728v1",
      "doi": "",
      "title": "The Future of Food: How Artificial Intelligence is Transforming Food Manufacturing",
      "abstract": "Artificial intelligence is accelerating a new era of food innovation, connecting data from farm to consumer to improve formulation, processing, and health outcomes. Recent advances in deep learning, natural language processing, and multi-omics integration make it possible to understand and optimize food systems with unprecedented depth. However, AI adoption across the food sector remains uneven due to heterogeneous datasets, limited model and system interoperability, and a persistent skills gap ",
      "authors": "Xu Zhou; Ivor Prado; AIFPDS participants; Ilias Tagkopoulos",
      "date": "2025-11-17",
      "year": "2025",
      "categories": [
        "cs.CY",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2511.14806v1",
      "doi": "",
      "title": "MergeDNA: Context-aware Genome Modeling with Dynamic Tokenization through Token Merging",
      "abstract": "Modeling genomic sequences faces two unsolved challenges: the information density varies widely across different regions, while there is no clearly defined minimum vocabulary unit. Relying on either four primitive bases or independently designed DNA tokenizers, existing approaches with naive masked language modeling pre-training often fail to adapt to the varying complexities of genomic sequences. Leveraging Token Merging techniques, this paper introduces a hierarchical architecture that jointly",
      "authors": "Siyuan Li; Kai Yu; Anna Wang; Zicheng Liu; Chang Yu",
      "date": "2025-11-17",
      "year": "2025",
      "categories": [
        "q-bio.GN",
        "cs.AI",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2511.11380v1",
      "doi": "",
      "title": "When Genes Speak: A Semantic-Guided Framework for Spatially Resolved Transcriptomics Data Clustering",
      "abstract": "Spatial transcriptomics enables gene expression profiling with spatial context, offering unprecedented insights into the tissue microenvironment. However, most computational models treat genes as isolated numerical features, ignoring the rich biological semantics encoded in their symbols. This prevents a truly deep understanding of critical biological characteristics. To overcome this limitation, we present SemST, a semantic-guided deep learning framework for spatial transcriptomics data cluster",
      "authors": "Jiangkai Long; Yanran Zhu; Chang Tang; Kun Sun; Yuanyuan Liu",
      "date": "2025-11-14",
      "year": "2025",
      "categories": [
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2511.02531v4",
      "doi": "",
      "title": "Causal Graph Neural Networks for Healthcare",
      "abstract": "Healthcare artificial intelligence systems routinely fail when deployed across institutions, with documented performance drops and perpetuation of discriminatory patterns embedded in historical data. This brittleness stems, in part, from learning statistical associations rather than causal mechanisms. Causal graph neural networks address this triple crisis of distribution shift, discrimination, and inscrutability by combining graph-based representations of biomedical data with causal inference p",
      "authors": "Munib Mesinovic; Max Buhlan; Tingting Zhu",
      "date": "2025-11-04",
      "year": "2025",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2510.24987v2",
      "doi": "",
      "title": "scMRDR: A scalable and flexible framework for unpaired single-cell multi-omics data integration",
      "abstract": "Advances in single-cell sequencing have enabled high-resolution profiling of diverse molecular modalities, while integrating unpaired multi-omics single-cell data remains challenging. Existing approaches either rely on pair information or prior correspondences, or require computing a global pairwise coupling matrix, limiting their scalability and flexibility. In this paper, we introduce a scalable and flexible generative framework called single-cell Multi-omics Regularized Disentangled Represent",
      "authors": "Jianle Sun; Chaoqi Liang; Ran Wei; Peng Zheng; Lei Bai",
      "date": "2025-10-28",
      "year": "2025",
      "categories": [
        "q-bio.QM",
        "cs.LG",
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2510.17064v3",
      "doi": "",
      "title": "A Brain Cell Type Resource Created by Large Language Models and a Multi-Agent AI System for Collaborative Community Annotation",
      "abstract": "Single-cell RNA sequencing has transformed our ability to identify diverse cell types and their transcriptomic signatures. However, annotating these signatures-especially those involving poorly characterized genes-remains a major challenge. Traditional methods, such as Gene Set Enrichment Analysis (GSEA), depend on well-curated annotations and often perform poorly in these contexts. Large Language Models (LLMs) offer a promising alternative but struggle to represent complex biological knowledge ",
      "authors": "Rongbin Li; Wenbo Chen; Zhao Li; Rodrigo Munoz-Castaneda; Jinbo Li",
      "date": "2025-10-20",
      "year": "2025",
      "categories": [
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2510.12498v2",
      "doi": "",
      "title": "Artificial Intelligence Virtual Cells: From Measurements to Decisions across Modality, Scale, Dynamics, and Evaluation",
      "abstract": "Artificial Intelligence Virtual Cells (AIVCs) aim to learn executable, decision-relevant models of cell state from multimodal, multiscale measurements. Recent studies have introduced single-cell and spatial foundation models, improved cross-modality alignment, scaled perturbation atlases, and explored pathway-level readouts. Nevertheless, although held-out validation is standard practice, evaluations remain predominantly within single datasets and settings; evidence indicates that transport acro",
      "authors": "Chengpeng Hu; Calvin Yu-Chian Chen",
      "date": "2025-10-14",
      "year": "2025",
      "categories": [
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2510.13883v1",
      "doi": "",
      "title": "Large Language Model Agents Enable Autonomous Design and Image Analysis of Microwell Microfluidics",
      "abstract": "Microwell microfluidics has been utilized for single-cell analysis to reveal heterogeneity in gene expression, signaling pathways, and phenotypic responses for identifying rare cell types, understanding disease progression, and developing more precise therapeutic strategies. However, designing microwell microfluidics is a considerably complex task, requiring knowledge, experience, and CAD software, as well as manual intervention, which often fails initial designs, demanding multiple costly and t",
      "authors": "Dinh-Nguyen Nguyen; Sadia Shakil; Raymond Kai-Yu Tong; Ngoc-Duy Dinh",
      "date": "2025-10-14",
      "year": "2025",
      "categories": [
        "q-bio.NC",
        "cs.MA"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2510.07793v3",
      "doi": "",
      "title": "LLM4Cell: A Survey of Large Language and Agentic Models for Single-Cell Biology",
      "abstract": "Large language models (LLMs) and emerging agentic frameworks are beginning to transform single-cell biology by enabling natural-language reasoning, generative annotation, and multimodal data integration. However, progress remains fragmented across data modalities, architectures, and evaluation standards. LLM4Cell presents the first unified survey of 58 foundation and agentic models developed for single-cell research, spanning RNA, ATAC, multi-omic, and spatial modalities. We categorize these met",
      "authors": "Sajib Acharjee Dip; Adrika Zafor; Bikash Kumar Paul; Uddip Acharjee Shuvo; Muhit Islam Emon",
      "date": "2025-10-09",
      "year": "2025",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2510.03455v1",
      "doi": "",
      "title": "PEaRL: Pathway-Enhanced Representation Learning for Gene and Pathway Expression Prediction from Histology",
      "abstract": "Integrating histopathology with spatial transcriptomics (ST) provides a powerful opportunity to link tissue morphology with molecular function. Yet most existing multimodal approaches rely on a small set of highly variable genes, which limits predictive scope and overlooks the coordinated biological programs that shape tissue phenotypes. We present PEaRL (Pathway Enhanced Representation Learning), a multimodal framework that represents transcriptomics through pathway activation scores computed w",
      "authors": "Sejuti Majumder; Saarthak Kapse; Moinak Bhattacharya; Xuan Xu; Alisa Yurovsky",
      "date": "2025-10-03",
      "year": "2025",
      "categories": [
        "cs.CV"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2510.01428v1",
      "doi": "",
      "title": "BioVERSE: Representation Alignment of Biomedical Modalities to LLMs for Multi-Modal Reasoning",
      "abstract": "Recent advances in large language models (LLMs) and biomedical foundation models (BioFMs) have achieved strong results in biological text reasoning, molecular modeling, and single-cell analysis, yet they remain siloed in disjoint embedding spaces, limiting cross-modal reasoning. We present BIOVERSE (Biomedical Vector Embedding Realignment for Semantic Engagement), a two-stage approach that adapts pretrained BioFMs as modality encoders and aligns them with LLMs through lightweight, modality-speci",
      "authors": "Ching-Huei Tsou; Michal Ozery-Flato; Ella Barkan; Diwakar Mahajan; Ben Shapira",
      "date": "2025-10-01",
      "year": "2025",
      "categories": [
        "q-bio.QM",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2509.26223v1",
      "doi": "",
      "title": "Nephrobase Cell+: Multimodal Single-Cell Foundation Model for Decoding Kidney Biology",
      "abstract": "Background: Large foundation models have revolutionized single-cell analysis, yet no kidney-specific model currently exists, and it remains unclear whether organ-focused models can outperform generalized models. The kidney's complex cellular architecture further complicate integration of large-scale omics data, where current frameworks trained on limited datasets struggle to correct batch effects, capture cross-modality variation, and generalize across species. Methods: We developed Nephrobase C",
      "authors": "Chenyu Li; Elias Ziyadeh; Yash Sharma; Bernhard Dumoulin; Jonathan Levinsohn",
      "date": "2025-09-30",
      "year": "2025",
      "categories": [
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2509.24840v2",
      "doi": "",
      "title": "Cell2Text: Multimodal LLM for Generating Single-Cell Descriptions from RNA-Seq Data",
      "abstract": "Single-cell RNA sequencing has transformed biology by enabling the measurement of gene expression at cellular resolution, providing information for cell types, states, and disease contexts. Recently, single-cell foundation models have emerged as powerful tools for learning transferable representations directly from expression profiles, improving performance on classification and clustering tasks. However, these models are limited to discrete prediction heads, which collapse cellular complexity i",
      "authors": "Oussama Kharouiche; Aris Markogiannakis; Xiao Fei; Michail Chatzianastasis; Michalis Vazirgiannis",
      "date": "2025-09-29",
      "year": "2025",
      "categories": [
        "cs.LG",
        "cs.CE"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2509.23986v1",
      "doi": "",
      "title": "TusoAI: Agentic Optimization for Scientific Methods",
      "abstract": "Scientific discovery is often slowed by the manual development of computational tools needed to analyze complex experimental data. Building such tools is costly and time-consuming because scientists must iteratively review literature, test modeling and scientific assumptions against empirical data, and implement these insights into efficient software. Large language models (LLMs) have demonstrated strong capabilities in synthesizing literature, reasoning with empirical data, and generating domai",
      "authors": "Alistair Turcan; Kexin Huang; Lei Li; Martin Jinye Zhang",
      "date": "2025-09-28",
      "year": "2025",
      "categories": [
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2509.23543v1",
      "doi": "",
      "title": "Contrastive Learning Enhances Language Model Based Cell Embeddings for Low-Sample Single Cell Transcriptomics",
      "abstract": "Large language models (LLMs) have shown strong ability in generating rich representations across domains such as natural language processing and generation, computer vision, and multimodal learning. However, their application in biomedical data analysis remains nascent. Single-cell transcriptomic profiling is essential for dissecting cell subtype diversity in development and disease, but rare subtypes pose challenges for scaling laws. We present a computational framework that integrates single-c",
      "authors": "Luxuan Zhang; Douglas Jiang; Qinglong Wang; Haoqi Sun; Feng Tian",
      "date": "2025-09-28",
      "year": "2025",
      "categories": [
        "q-bio.GN",
        "cs.NE",
        "q-bio.MN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2509.20935v2",
      "doi": "",
      "title": "GALAX: Graph-Augmented Language Model for Explainable Reinforcement-Guided Subgraph Reasoning in Precision Medicine",
      "abstract": "In precision medicine, quantitative multi-omic features, topological context, and textual biological knowledge play vital roles in identifying disease-critical signaling pathways and targets. Existing pipelines capture only part of these-numerical omics ignore topological context, text-centric LLMs lack quantitative grounded reasoning, and graph-only models underuse node semantics and the generalization of LLMs-limiting mechanistic interpretability. Although Process Reward Models (PRMs) aim to g",
      "authors": "Heming Zhang; Di Huang; Wenyu Li; Michael Province; Yixin Chen",
      "date": "2025-09-25",
      "year": "2025",
      "categories": [
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2509.16892v1",
      "doi": "",
      "title": "Learning from Gene Names, Expression Values and Images: Contrastive Masked Text-Image Pretraining for Spatial Transcriptomics Representation Learning",
      "abstract": "Spatial transcriptomics aims to connect high-resolution histology images with spatially resolved gene expression. To achieve better performance on downstream tasks such as gene expression prediction, large-scale pre-training is required to obtain generalisable representations that can bridge histology and transcriptomics across tissues, protocols, and laboratories. Existing cross-modal pre-training approaches for spatial transcriptomics rely on either gene names or expression values in isolation",
      "authors": "Jiahe Qian; Yaoyu Fang; Ziqiao Weng; Xinkun Wang; Lee A. Cooper",
      "date": "2025-09-21",
      "year": "2025",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2509.14723v1",
      "doi": "",
      "title": "Transcoder-based Circuit Analysis for Interpretable Single-Cell Foundation Models",
      "abstract": "Single-cell foundation models (scFMs) have demonstrated state-of-the-art performance on various tasks, such as cell-type annotation and perturbation response prediction, by learning gene regulatory networks from large-scale transcriptome data. However, a significant challenge remains: the decision-making processes of these models are less interpretable compared to traditional methods like differential gene expression analysis. Recently, transcoders have emerged as a promising approach for extrac",
      "authors": "Sosuke Hosokawa; Toshiharu Kawakami; Satoshi Kodera; Masamichi Ito; Norihiko Takeda",
      "date": "2025-09-18",
      "year": "2025",
      "categories": [
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2509.09740v1",
      "doi": "",
      "title": "HypoGeneAgent: A Hypothesis Language Agent for Gene-Set Cluster Resolution Selection Using Perturb-seq Datasets",
      "abstract": "Large-scale single-cell and Perturb-seq investigations routinely involve clustering cells and subsequently annotating each cluster with Gene-Ontology (GO) terms to elucidate the underlying biological programs. However, both stages, resolution selection and functional annotation, are inherently subjective, relying on heuristics and expert curation. We present HYPOGENEAGENT, a large language model (LLM)-driven framework, transforming cluster annotation into a quantitatively optimizable task. Initi",
      "authors": "Ying Yuan; Xing-Yue Monica Ge; Aaron Archer Waterman; Tommaso Biancalani; David Richmond",
      "date": "2025-09-10",
      "year": "2025",
      "categories": [
        "q-bio.QM",
        "cs.AI",
        "cs.CL",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2509.06917v2",
      "doi": "",
      "title": "Paper2Agent: Reimagining Research Papers As Interactive and Reliable AI Agents",
      "abstract": "We introduce Paper2Agent, an automated framework that converts research papers into AI agents. Paper2Agent transforms research output from passive artifacts into active systems that can accelerate downstream use, adoption, and discovery. Conventional research papers require readers to invest substantial effort to understand and adapt a paper's code, data, and methods to their own work, creating barriers to dissemination and reuse. Paper2Agent addresses this challenge by automatically converting ",
      "authors": "Jiacheng Miao; Joe R. Davis; Yaohui Zhang; Jonathan K. Pritchard; James Zou",
      "date": "2025-09-08",
      "year": "2025",
      "categories": [
        "cs.AI",
        "cs.CL",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2509.06503v1",
      "doi": "",
      "title": "An AI system to help scientists write expert-level empirical software",
      "abstract": "The cycle of scientific discovery is frequently bottlenecked by the slow, manual creation of software to support computational experiments. To address this, we present an AI system that creates expert-level scientific software whose goal is to maximize a quality metric. The system uses a Large Language Model (LLM) and Tree Search (TS) to systematically improve the quality metric and intelligently navigate the large space of possible solutions. The system achieves expert-level results when it exp",
      "authors": "Eser Aygün; Anastasiya Belyaeva; Gheorghe Comanici; Marc Coram; Hao Cui",
      "date": "2025-09-08",
      "year": "2025",
      "categories": [
        "cs.AI",
        "q-bio.QM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2508.14393v1",
      "doi": "",
      "title": "Img2ST-Net: Efficient High-Resolution Spatial Omics Prediction from Whole Slide Histology Images via Fully Convolutional Image-to-Image Learning",
      "abstract": "Recent advances in multi-modal AI have demonstrated promising potential for generating the currently expensive spatial transcriptomics (ST) data directly from routine histology images, offering a means to reduce the high cost and time-intensive nature of ST data acquisition. However, the increasing resolution of ST, particularly with platforms such as Visium HD achieving 8um or finer, introduces significant computational and modeling challenges. Conventional spot-by-spot sequential regression fr",
      "authors": "Junchao Zhu; Ruining Deng; Junlin Guo; Tianyuan Yao; Juming Xiong",
      "date": "2025-08-20",
      "year": "2025",
      "categories": [
        "cs.CV"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2508.13201v2",
      "doi": "",
      "title": "Benchmarking LLM-based Agents for Single-cell Omics Analysis",
      "abstract": "The surge in multimodal single-cell omics data exposes limitations in traditional, manually defined analysis workflows. AI agents offer a paradigm shift, enabling adaptive planning, executable code generation, traceable decisions, and real-time knowledge fusion. However, the lack of a comprehensive benchmark critically hinders progress. We introduce a novel benchmarking evaluation system to rigorously assess agent capabilities in single-cell omics analysis. This system comprises: a unified platf",
      "authors": "Yang Liu; Lu Zhou; Xiawei Du; Ruikun He; Rongbo Shen",
      "date": "2025-08-16",
      "year": "2025",
      "categories": [
        "q-bio.GN",
        "cs.AI",
        "cs.MA"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2508.01490v2",
      "doi": "",
      "title": "A Large-Scale Benchmark of Cross-Modal Learning for Histology and Gene Expression in Spatial Transcriptomics",
      "abstract": "Spatial transcriptomics enables simultaneous measurement of gene expression and tissue morphology, offering unprecedented insights into cellular organization and disease mechanisms. However, the field lacks comprehensive benchmarks for evaluating multimodal learning methods that leverage both histology images and gene expression data. Here, we present HESCAPE, a large-scale benchmark for cross-modal contrastive pretraining in spatial transcriptomics, built on a curated pan-organ dataset spanning",
      "authors": "Rushin H. Gindra; Giovanni Palla; Mathias Nguyen; Sophia J. Wagner; Manuel Tran",
      "date": "2025-08-02",
      "year": "2025",
      "categories": [
        "q-bio.GN",
        "cs.AI",
        "cs.CV",
        "cs.LG",
        "q-bio.TO",
        "stat.AP"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2508.00969v2",
      "doi": "",
      "title": "Masked Omics Modeling for Multimodal Representation Learning across Histopathology and Molecular Profiles",
      "abstract": "Self-supervised learning (SSL) has driven major advances in computational pathology by enabling the learning of rich representations from histopathology data. Yet, tissue analysis alone may fall short in capturing broader molecular complexity, as key complementary information resides in high-dimensional omics profiles such as transcriptomics, methylomics, and genomics. To address this gap, we introduce MORPHEUS, the first multimodal pre-training strategy that integrates histopathology images and",
      "authors": "Lucas Robinet; Ahmad Berjaoui; Elizabeth Cohen-Jonathan Moyal",
      "date": "2025-08-01",
      "year": "2025",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2507.22212v1",
      "doi": "",
      "title": "Evaluating Integrative Strategies for Incorporating Phenotypic Features in Spatial Transcriptomics",
      "abstract": "Spatial transcriptomics (ST) technologies not only offer an unprecedented opportunity to interrogate intact biological samples in a spatially informed manner, but also set the stage for integration with other imaging-based modalities. However, how to best exploit spatial context and integrate ST with imaging-based modalities remains an open question. To address this, particularly under real-world experimental constraints such as limited dataset size, class imbalance, and bounding-box-based segme",
      "authors": "Levin M Moser; Ahmad Kamal Hamid; Esteban Miglietta; Nodar Gogoberidze; Beth A Cimini",
      "date": "2025-07-29",
      "year": "2025",
      "categories": [
        "q-bio.QM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2507.20122v2",
      "doi": "",
      "title": "From Prompt to Pipeline: Large Language Models for Scientific Workflow Development in Bioinformatics",
      "abstract": "Scientific Workflow Systems such as Galaxy and Nextflow are essential for scalable, reproducible, and automated bioinformatics analyses. However, developing and understanding scientific workflows remains challenging for many domain scientists due to the complexity of tool/module selection, infrastructure requirements, and limited programming expertise. This study explores whether state-of-the-art Large Language Models such as GPT-4o, Gemini 2.5 Flash, and DeepSeek-V3 can assist in generating acc",
      "authors": "Khairul Alam; Banani Roy",
      "date": "2025-07-27",
      "year": "2025",
      "categories": [
        "cs.SE"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2507.14670v3",
      "doi": "",
      "title": "Gene-DML: Dual-Pathway Multi-Level Discrimination for Gene Expression Prediction from Histopathology Images",
      "abstract": "Accurately predicting gene expression from histopathology images offers a scalable and non-invasive approach to molecular profiling, with significant implications for precision medicine and computational pathology. However, existing methods often underutilize the cross-modal representation alignment between histopathology images and gene expression profiles across multiple representational levels, thereby limiting their prediction performance. To address this, we propose Gene-DML, a unified fram",
      "authors": "Yaxuan Song; Jianan Fan; Hang Chang; Weidong Cai",
      "date": "2025-07-19",
      "year": "2025",
      "categories": [
        "cs.CV"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2507.10039v1",
      "doi": "",
      "title": "Towards Applying Large Language Models to Complement Single-Cell Foundation Models",
      "abstract": "Single-cell foundation models such as scGPT represent a significant advancement in single-cell omics, with an ability to achieve state-of-the-art performance on various downstream biological tasks. However, these models are inherently limited in that a vast amount of information in biology exists as text, which they are unable to leverage. There have therefore been several recent works that propose the use of LLMs as an alternative to single-cell foundation models, achieving competitive results.",
      "authors": "Steven Palayew; Bo Wang; Gary Bader",
      "date": "2025-07-14",
      "year": "2025",
      "categories": [
        "cs.LG",
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2507.09028v2",
      "doi": "",
      "title": "From Classical Machine Learning to Emerging Foundation Models: Review on Multimodal Data Integration for Cancer Research",
      "abstract": "Cancer research is increasingly driven by the integration of diverse data modalities, spanning from genomics and proteomics to imaging and clinical factors. However, extracting actionable insights from these vast and heterogeneous datasets remains a key challenge. The rise of foundation models (FMs) -- large deep-learning models pretrained on extensive amounts of data serving as a backbone for a wide range of downstream tasks -- offers new avenues for discovering biomarkers, improving diagnosis,",
      "authors": "Amgad Muneer; Muhammad Waqas; Maliazurina B Saad; Eman Showkatian; Rukhmini Bandyopadhyay",
      "date": "2025-07-11",
      "year": "2025",
      "categories": [
        "q-bio.QM",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2507.07454v1",
      "doi": "",
      "title": "Mix-Geneformer: Unified Representation Learning for Human and Mouse scRNA-seq Data",
      "abstract": "Single-cell RNA sequencing (scRNA-seq) enables single-cell transcriptomic profiling, revealing cellular heterogeneity and rare populations. Recent deep learning models like Geneformer and Mouse-Geneformer perform well on tasks such as cell-type classification and in silico perturbation. However, their species-specific design limits cross-species generalization and translational applications, which are crucial for advancing translational research and drug discovery. We present Mix-Geneformer, a n",
      "authors": "Yuki Nishio; Takayoshi Yamashita; Keita Ito; Tsubasa Hirakawa; Hironobu Fujiyoshi",
      "date": "2025-07-10",
      "year": "2025",
      "categories": [
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2507.06418v1",
      "doi": "",
      "title": "PAST: A multimodal single-cell foundation model for histopathology and spatial transcriptomics in cancer",
      "abstract": "While pathology foundation models have transformed cancer image analysis, they often lack integration with molecular data at single-cell resolution, limiting their utility for precision oncology. Here, we present PAST, a pan-cancer single-cell foundation model trained on 20 million paired histopathology images and single-cell transcriptomes spanning multiple tumor types and tissue contexts. By jointly encoding cellular morphology and gene expression, PAST learns unified cross-modal representatio",
      "authors": "Changchun Yang; Haoyang Li; Yushuai Wu; Yilan Zhang; Yifeng Jiao",
      "date": "2025-07-08",
      "year": "2025",
      "categories": [
        "q-bio.QM",
        "cs.CV",
        "stat.AP"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2507.04704v1",
      "doi": "",
      "title": "SPATIA: Multimodal Model for Prediction and Generation of Spatial Cell Phenotypes",
      "abstract": "Understanding how cellular morphology, gene expression, and spatial organization jointly shape tissue function is a central challenge in biology. Image-based spatial transcriptomics technologies now provide high-resolution measurements of cell images and gene expression profiles, but machine learning methods typically analyze these modalities in isolation or at limited resolution. We address the problem of learning unified, spatially aware representations that integrate cell morphology, gene exp",
      "authors": "Zhenglun Kong; Mufan Qiu; John Boesen; Xiang Lin; Sukwon Yun",
      "date": "2025-07-07",
      "year": "2025",
      "categories": [
        "q-bio.QM",
        "cs.AI",
        "cs.CV"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2507.02980v1",
      "doi": "",
      "title": "Modeling Gene Expression Distributional Shifts for Unseen Genetic Perturbations",
      "abstract": "We train a neural network to predict distributional responses in gene expression following genetic perturbations. This is an essential task in early-stage drug discovery, where such responses can offer insights into gene function and inform target identification. Existing methods only predict changes in the mean expression, overlooking stochasticity inherent in single-cell data. In contrast, we offer a more realistic view of cellular responses by modeling expression distributions. Our model pred",
      "authors": "Kalyan Ramakrishnan; Jonathan G. Hedley; Sisi Qu; Puneet K. Dokania; Philip H. S. Torr",
      "date": "2025-07-01",
      "year": "2025",
      "categories": [
        "q-bio.GN",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2507.05265v1",
      "doi": "",
      "title": "BMFM-DNA: A SNP-aware DNA foundation model to capture variant effects",
      "abstract": "Large language models (LLMs) trained on text demonstrated remarkable results on natural language processing (NLP) tasks. These models have been adapted to decipher the language of DNA, where sequences of nucleotides act as \"words\" that encode genomic functions. However, the genome differs fundamentally from natural language, as it lacks clearly defined words or a consistent grammar. Although DNA language models (DNALMs) such as DNABERT, GENA-LM have achieved high level of performance on genome-r",
      "authors": "Hongyang Li; Sanjoy Dey; Bum Chul Kwon; Michael Danziger; Michal Rosen-Tzvi",
      "date": "2025-06-26",
      "year": "2025",
      "categories": [
        "q-bio.GN",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2506.14861v1",
      "doi": "",
      "title": "BMFM-RNA: An Open Framework for Building and Evaluating Transcriptomic Foundation Models",
      "abstract": "Transcriptomic foundation models (TFMs) have recently emerged as powerful tools for analyzing gene expression in cells and tissues, supporting key tasks such as cell-type annotation, batch correction, and perturbation prediction. However, the diversity of model implementations and training strategies across recent TFMs, though promising, makes it challenging to isolate the contribution of individual design choices or evaluate their potential synergies. This hinders the field's ability to converg",
      "authors": "Bharath Dandala; Michael M. Danziger; Ella Barkan; Tanwi Biswas; Viatcheslav Gurev",
      "date": "2025-06-17",
      "year": "2025",
      "categories": [
        "q-bio.GN",
        "cs.AI",
        "q-bio.QM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2506.10037v2",
      "doi": "",
      "title": "The Cell Ontology in the age of single-cell omics",
      "abstract": "Single-cell omics technologies have transformed our understanding of cellular diversity by enabling high-resolution profiling of individual cells. However, the unprecedented scale and heterogeneity of these datasets demand robust frameworks for data integration and annotation. The Cell Ontology (CL) has emerged as a pivotal resource for achieving FAIR (Findable, Accessible, Interoperable, and Reusable) data principles by providing standardized, species-agnostic terms for canonical cell types - f",
      "authors": "Shawn Zheng Kai Tan; Aleix Puig-Barbe; Damien Goutte-Gattat; Caroline Eastwood; Brian Aevermann",
      "date": "2025-06-10",
      "year": "2025",
      "categories": [
        "q-bio.OT",
        "cs.IR"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2506.08936v1",
      "doi": "",
      "title": "BioLangFusion: Multimodal Fusion of DNA, mRNA, and Protein Language Models",
      "abstract": "We present BioLangFusion, a simple approach for integrating pre-trained DNA, mRNA, and protein language models into unified molecular representations. Motivated by the central dogma of molecular biology (information flow from gene to transcript to protein), we align per-modality embeddings at the biologically meaningful codon level (three nucleotides encoding one amino acid) to ensure direct cross-modal correspondence. BioLangFusion studies three standard fusion techniques: (i) codon-level embed",
      "authors": "Amina Mollaysa; Artem Moskale; Pushpak Pati; Tommaso Mansi; Mangal Prakash",
      "date": "2025-06-10",
      "year": "2025",
      "categories": [
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2506.10031v1",
      "doi": "",
      "title": "scSSL-Bench: Benchmarking Self-Supervised Learning for Single-Cell Data",
      "abstract": "Self-supervised learning (SSL) has proven to be a powerful approach for extracting biologically meaningful representations from single-cell data. To advance our understanding of SSL methods applied to single-cell data, we present scSSL-Bench, a comprehensive benchmark that evaluates nineteen SSL methods. Our evaluation spans nine datasets and focuses on three common downstream tasks: batch correction, cell type annotation, and missing modality prediction. Furthermore, we systematically assess va",
      "authors": "Olga Ovcharenko; Florian Barkmann; Philip Toma; Imant Daunhawer; Julia Vogt",
      "date": "2025-06-10",
      "year": "2025",
      "categories": [
        "q-bio.QM",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2506.05542v1",
      "doi": "",
      "title": "Agentomics-ML: Autonomous Machine Learning Experimentation Agent for Genomic and Transcriptomic Data",
      "abstract": "The adoption of machine learning (ML) and deep learning methods has revolutionized molecular medicine by driving breakthroughs in genomics, transcriptomics, drug discovery, and biological systems modeling. The increasing quantity, multimodality, and heterogeneity of biological datasets demand automated methods that can produce generalizable predictive models. Recent developments in large language model-based agents have shown promise for automating end-to-end ML experimentation on structured ben",
      "authors": "Vlastimil Martinek; Andrea Gariboldi; Dimosthenis Tzimotoudis; Aitor Alberdi Escudero; Edward Blake",
      "date": "2025-06-05",
      "year": "2025",
      "categories": [
        "cs.LG",
        "cs.MA"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2506.02911v1",
      "doi": "",
      "title": "Cell-o1: Training LLMs to Solve Single-Cell Reasoning Puzzles with Reinforcement Learning",
      "abstract": "Cell type annotation is a key task in analyzing the heterogeneity of single-cell RNA sequencing data. Although recent foundation models automate this process, they typically annotate cells independently, without considering batch-level cellular context or providing explanatory reasoning. In contrast, human experts often annotate distinct cell types for different cell clusters based on their domain knowledge. To mimic this workflow, we introduce the CellPuzzles task, where the objective is to ass",
      "authors": "Yin Fang; Qiao Jin; Guangzhi Xiong; Bowen Jin; Xianrui Zhong",
      "date": "2025-06-03",
      "year": "2025",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.CE",
        "cs.HC",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2506.02212v1",
      "doi": "",
      "title": "Leveraging Natural Language Processing to Unravel the Mystery of Life: A Review of NLP Approaches in Genomics, Transcriptomics, and Proteomics",
      "abstract": "Natural Language Processing (NLP) has transformed various fields beyond linguistics by applying techniques originally developed for human language to the analysis of biological sequences. This review explores the application of NLP methods to biological sequence data, focusing on genomics, transcriptomics, and proteomics. We examine how various NLP methods, from classic approaches like word2vec to advanced models employing transformers and hyena operators, are being adapted to analyze DNA, RNA, ",
      "authors": "Ella Rannon; David Burstein",
      "date": "2025-06-02",
      "year": "2025",
      "categories": [
        "cs.CL",
        "cs.AI",
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2506.01918v1",
      "doi": "",
      "title": "Spatial Coordinates as a Cell Language: A Multi-Sentence Framework for Imaging Mass Cytometry Analysis",
      "abstract": "Image mass cytometry (IMC) enables high-dimensional spatial profiling by combining mass cytometry's analytical power with spatial distributions of cell phenotypes. Recent studies leverage large language models (LLMs) to extract cell states by translating gene or protein expression into biological context. However, existing single-cell LLMs face two major challenges: (1) Integration of spatial information: they struggle to generalize spatial coordinates and effectively encode spatial context as t",
      "authors": "Chi-Jane Chen; Yuhang Chen; Sukwon Yun; Natalie Stanley; Tianlong Chen",
      "date": "2025-06-02",
      "year": "2025",
      "categories": [
        "cs.CL"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2505.21317v1",
      "doi": "",
      "title": "A Cross Modal Knowledge Distillation & Data Augmentation Recipe for Improving Transcriptomics Representations through Morphological Features",
      "abstract": "Understanding cellular responses to stimuli is crucial for biological discovery and drug development. Transcriptomics provides interpretable, gene-level insights, while microscopy imaging offers rich predictive features but is harder to interpret. Weakly paired datasets, where samples share biological states, enable multimodal learning but are scarce, limiting their utility for training and multimodal inference. We propose a framework to enhance transcriptomics by distilling knowledge from micro",
      "authors": "Ihab Bendidi; Yassir El Mesbahi; Alisandra K. Denton; Karush Suri; Kian Kenyon-Dean",
      "date": "2025-05-27",
      "year": "2025",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2505.10729v1",
      "doi": "",
      "title": "Adaptive Spatial Transcriptomics Interpolation via Cross-modal Cross-slice Modeling",
      "abstract": "Spatial transcriptomics (ST) is a promising technique that characterizes the spatial gene profiling patterns within the tissue context. Comprehensive ST analysis depends on consecutive slices for 3D spatial insights, whereas the missing intermediate tissue sections and high costs limit the practical feasibility of generating multi-slice ST. In this paper, we propose C2-STi, the first attempt for interpolating missing ST slices at arbitrary intermediate positions between adjacent ST slices. Despi",
      "authors": "NingFeng Que; Xiaofei Wang; Jingjing Chen; Yixuan Jiang; Chao Li",
      "date": "2025-05-15",
      "year": "2025",
      "categories": [
        "eess.IV",
        "cs.CV",
        "q-bio.QM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2505.07896v1",
      "doi": "",
      "title": "Bridging Large Language Models and Single-Cell Transcriptomics in Dissecting Selective Motor Neuron Vulnerability",
      "abstract": "Understanding cell identity and function through single-cell level sequencing data remains a key challenge in computational biology. We present a novel framework that leverages gene-specific textual annotations from the NCBI Gene database to generate biologically contextualized cell embeddings. For each cell in a single-cell RNA sequencing (scRNA-seq) dataset, we rank genes by expression level, retrieve their NCBI Gene descriptions, and transform these descriptions into vector embedding represen",
      "authors": "Douglas Jiang; Zilin Dai; Luxuan Zhang; Qiyi Yu; Haoqi Sun",
      "date": "2025-05-12",
      "year": "2025",
      "categories": [
        "q-bio.GN",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2505.07865v1",
      "doi": "",
      "title": "CellVerse: Do Large Language Models Really Understand Cell Biology?",
      "abstract": "Recent studies have demonstrated the feasibility of modeling single-cell data as natural languages and the potential of leveraging powerful large language models (LLMs) for understanding cell biology. However, a comprehensive evaluation of LLMs' performance on language-driven single-cell analysis tasks still remains unexplored. Motivated by this challenge, we introduce CellVerse, a unified language-centric question-answering benchmark that integrates four types of single-cell multi-omics data an",
      "authors": "Fan Zhang; Tianyu Liu; Zhihong Zhu; Hao Wu; Haixin Wang",
      "date": "2025-05-09",
      "year": "2025",
      "categories": [
        "q-bio.QM",
        "cs.AI",
        "cs.CL",
        "q-bio.CB"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2505.05612v1",
      "doi": "",
      "title": "scDrugMap: Benchmarking Large Foundation Models for Drug Response Prediction",
      "abstract": "Drug resistance presents a major challenge in cancer therapy. Single cell profiling offers insights into cellular heterogeneity, yet the application of large-scale foundation models for predicting drug response in single cell data remains underexplored. To address this, we developed scDrugMap, an integrated framework featuring both a Python command-line interface and a web server for drug response prediction. scDrugMap evaluates a wide range of foundation models, including eight single-cell mode",
      "authors": "Qing Wang; Yining Pan; Minghao Zhou; Zijia Tang; Yanfei Wang",
      "date": "2025-05-08",
      "year": "2025",
      "categories": [
        "cs.AI",
        "cs.LG",
        "q-bio.QM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2505.05577v2",
      "doi": "",
      "title": "PyTDC: A multimodal machine learning training, evaluation, and inference platform for biomedical foundation models",
      "abstract": "Existing biomedical benchmarks do not provide end-to-end infrastructure for training, evaluation, and inference of models that integrate multimodal biological data and a broad range of machine learning tasks in therapeutics. We present PyTDC, an open-source machine-learning platform providing streamlined training, evaluation, and inference software for multimodal biological AI models. PyTDC unifies distributed, heterogeneous, continuously updated data sources and model weights and standardizes b",
      "authors": "Alejandro Velez-Arce; Jesus Caraballo; Marinka Zitnik",
      "date": "2025-05-08",
      "year": "2025",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2505.00017v1",
      "doi": "",
      "title": "ReCellTy: Domain-specific knowledge graph retrieval-augmented LLMs workflow for single-cell annotation",
      "abstract": "To enable precise and fully automated cell type annotation with large language models (LLMs), we developed a graph structured feature marker database to retrieve entities linked to differential genes for cell reconstruction. We further designed a multi task workflow to optimize the annotation process. Compared to general purpose LLMs, our method improves human evaluation scores by up to 0.21 and semantic similarity by 6.1% across 11 tissue types, while more closely aligning with the cognitive lo",
      "authors": "Dezheng Han; Yibin Jia; Ruxiao Chen; Wenjie Han; Shuaishuai Guo",
      "date": "2025-04-24",
      "year": "2025",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.DB",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2504.16520v1",
      "doi": "",
      "title": "A Few-Shot Metric Learning Method with Dual-Channel Attention for Cross-Modal Same-Neuron Identification",
      "abstract": "In neuroscience research, achieving single-neuron matching across different imaging modalities is critical for understanding the relationship between neuronal structure and function. However, modality gaps and limited annotations present significant challenges. We propose a few-shot metric learning method with a dual-channel attention mechanism and a pretrained vision transformer to enable robust cross-modal neuron identification. The local and global channels extract soma morphology and fiber c",
      "authors": "Wenwei Li; Liyi Cai; Wu Chen; Anan Li",
      "date": "2025-04-23",
      "year": "2025",
      "categories": [
        "cs.CV",
        "q-bio.NC"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2504.11610v1",
      "doi": "",
      "title": "Generalized probabilistic canonical correlation analysis for multi-modal data integration with full or partial observations",
      "abstract": "Background: The integration and analysis of multi-modal data are increasingly essential across various domains including bioinformatics. As the volume and complexity of such data grow, there is a pressing need for computational models that not only integrate diverse modalities but also leverage their complementary information to improve clustering accuracy and insights, especially when dealing with partial observations with missing data. Results: We propose Generalized Probabilistic Canonical Co",
      "authors": "Tianjian Yang; Wei Vivian Li",
      "date": "2025-04-15",
      "year": "2025",
      "categories": [
        "stat.ML",
        "cs.LG",
        "q-bio.QM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2504.09704v1",
      "doi": "",
      "title": "Transformer-Based Representation Learning for Robust Gene Expression Modeling and Cancer Prognosis",
      "abstract": "Transformer-based models have achieved remarkable success in natural language and vision tasks, but their application to gene expression analysis remains limited due to data sparsity, high dimensionality, and missing values. We present GexBERT, a transformer-based autoencoder framework for robust representation learning of gene expression data. GexBERT learns context-aware gene embeddings by pretraining on large-scale transcriptomic profiles with a masking and restoration objective that captures",
      "authors": "Shuai Jiang; Saeed Hassanpour",
      "date": "2025-04-13",
      "year": "2025",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2504.07061v1",
      "doi": "",
      "title": "Teaching pathology foundation models to accurately predict gene expression with parameter efficient knowledge transfer",
      "abstract": "Gene expression profiling provides critical insights into cellular heterogeneity, biological processes and disease mechanisms. There has been an increasing interest in computational approaches that can predict gene expression directly from digitalized histopathology images. While image foundation models have shown promise in a variety of pathology downstream analysis, their performances on gene-expression prediction are still limited. Explicitly incorporating information from the transcriptomic ",
      "authors": "Shi Pan; Jianan Chen; Maria Secrier",
      "date": "2025-04-09",
      "year": "2025",
      "categories": [
        "cs.CV"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2504.04698v1",
      "doi": "",
      "title": "scAgent: Universal Single-Cell Annotation via a LLM Agent",
      "abstract": "Cell type annotation is critical for understanding cellular heterogeneity. Based on single-cell RNA-seq data and deep learning models, good progress has been made in annotating a fixed number of cell types within a specific tissue. However, universal cell annotation, which can generalize across tissues, discover novel cell types, and extend to novel cell types, remains less explored. To fill this gap, this paper proposes scAgent, a universal cell annotation framework based on Large Language Mode",
      "authors": "Yuren Mao; Yu Mi; Peigen Liu; Mengfei Zhang; Hanqing Liu",
      "date": "2025-04-07",
      "year": "2025",
      "categories": [
        "cs.CL"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2504.03976v2",
      "doi": "",
      "title": "OLAF: An Open Life Science Analysis Framework for Conversational Bioinformatics Powered by Large Language Models",
      "abstract": "OLAF (Open Life Science Analysis Framework) is an open-source platform that enables researchers to perform bioinformatics analyses using natural language. By combining large language models (LLMs) with a modular agent-pipe-router architecture, OLAF generates and executes bioinformatics code on real scientific data, including formats like .h5ad. The system includes an Angular front end and a Python/Firebase backend, allowing users to run analyses such as single-cell RNA-seq workflows, gene annota",
      "authors": "Dylan Riffle; Nima Shirooni; Cody He; Manush Murali; Sovit Nayak",
      "date": "2025-04-04",
      "year": "2025",
      "categories": [
        "q-bio.QM",
        "cs.AI",
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2504.00020v2",
      "doi": "",
      "title": "Celler:A Genomic Language Model for Long-Tailed Single-Cell Annotation",
      "abstract": "Recent breakthroughs in single-cell technology have ushered in unparalleled opportunities to decode the molecular intricacy of intricate biological systems, especially those linked to diseases unique to humans. However, these progressions have also ushered in novel obstacles-specifically, the efficient annotation of extensive, long-tailed single-cell data pertaining to disease conditions. To effectively surmount this challenge, we introduce Celler, a state-of-the-art generative pre-training mode",
      "authors": "Huan Zhao; Yiming Liu; Jina Yao; Ling Xiong; Zexin Zhou",
      "date": "2025-03-28",
      "year": "2025",
      "categories": [
        "q-bio.GN",
        "cs.AI",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2503.20278v2",
      "doi": "https://doi.org/10.1093/bioinformatics/btaf595",
      "title": "The cell as a token: high-dimensional geometry in language models and cell embeddings",
      "abstract": "Single-cell sequencing technology maps cells to a high-dimensional space encoding their internal activity. Recently-proposed virtual cell models extend this concept, enriching cells' representations based on patterns learned from pretraining on vast cell atlases. This review explores how advances in understanding the structure of natural language embeddings informs ongoing efforts to analyze single-cell datasets. Both fields process unstructured data by partitioning datasets into tokens embedded",
      "authors": "William Gilpin",
      "date": "2025-03-26",
      "year": "2025",
      "categories": [
        "q-bio.QM",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2503.09427v4",
      "doi": "",
      "title": "Language-Enhanced Representation Learning for Single-Cell Transcriptomics",
      "abstract": "Single-cell RNA sequencing (scRNA-seq) offers detailed insights into cellular heterogeneity. Recent advancements leverage single-cell large language models (scLLMs) for effective representation learning. These models focus exclusively on transcriptomic data, neglecting complementary biological knowledge from textual descriptions. To overcome this limitation, we propose scMMGPT, a novel multimodal framework designed for language-enhanced representation learning in single-cell transcriptomics. Unl",
      "authors": "Yaorui Shi; Jiaqi Yang; Changhao Nai; Sihang Li; Junfeng Fang",
      "date": "2025-03-12",
      "year": "2025",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2503.04490v2",
      "doi": "",
      "title": "Large Language Models in Bioinformatics: A Survey",
      "abstract": "Large Language Models (LLMs) are revolutionizing bioinformatics, enabling advanced analysis of DNA, RNA, proteins, and single-cell data. This survey provides a systematic review of recent advancements, focusing on genomic sequence modeling, RNA structure prediction, protein function inference, and single-cell transcriptomics. Meanwhile, we also discuss several key challenges, including data scarcity, computational complexity, and cross-omics integration, and explore future directions such as mul",
      "authors": "Zhenyu Wang; Zikang Wang; Jiyue Jiang; Pengan Chen; Xiangyu Shi",
      "date": "2025-03-06",
      "year": "2025",
      "categories": [
        "cs.CL",
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2503.00804v1",
      "doi": "",
      "title": "DELST: Dual Entailment Learning for Hyperbolic Image-Gene Pretraining in Spatial Transcriptomics",
      "abstract": "Spatial transcriptomics (ST) maps gene expression within tissue at individual spots, making it a valuable resource for multimodal representation learning. Additionally, ST inherently contains rich hierarchical information both across and within modalities. For instance, different spots exhibit varying numbers of nonzero gene expressions, corresponding to different levels of cellular activity and semantic hierarchies. However, existing methods rely on contrastive alignment of image-gene pairs, fa",
      "authors": "Xulin Chen; Junzhou Huang",
      "date": "2025-03-02",
      "year": "2025",
      "categories": [
        "cs.CV",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2502.00568v4",
      "doi": "",
      "title": "Generating crossmodal gene expression from cancer histopathology improves multimodal AI predictions",
      "abstract": "Emerging research has highlighted that artificial intelligence-based multimodal fusion of digital pathology and transcriptomic features can improve cancer diagnosis (grading/subtyping) and prognosis (survival risk) prediction. However, such direct fusion is impractical in clinical settings, where histopathology remains the gold standard and transcriptomic tests are rarely requested in public healthcare. We experiment on two publicly available multimodal datasets, The Cancer Genomic Atlas and the",
      "authors": "Samiran Dey; Christopher R. S. Banerji; Partha Basuchowdhuri; Sanjoy K. Saha; Deepak Parashar",
      "date": "2025-02-01",
      "year": "2025",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2501.17729v1",
      "doi": "",
      "title": "A technical review of multi-omics data integration methods: from classical statistical to deep generative approaches",
      "abstract": "The rapid advancement of high-throughput sequencing and other assay technologies has resulted in the generation of large and complex multi-omics datasets, offering unprecedented opportunities for advancing precision medicine strategies. However, multi-omics data integration presents significant challenges due to the high dimensionality, heterogeneity, experimental gaps, and frequency of missing values across data types. Computational methods have been developed to address these issues, employing",
      "authors": "Ana R. Baião; Zhaoxiang Cai; Rebecca C Poulos; Phillip J. Robinson; Roger R Reddel",
      "date": "2025-01-29",
      "year": "2025",
      "categories": [
        "q-bio.QM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2501.16361v1",
      "doi": "",
      "title": "Large Language Models Meet Graph Neural Networks for Text-Numeric Graph Reasoning",
      "abstract": "In real-world scientific discovery, human beings always make use of the accumulated prior knowledge with imagination pick select one or a few most promising hypotheses from large and noisy data analysis results. In this study, we introduce a new type of graph structure, the text-numeric graph (TNG), which is defined as graph entities and associations have both text-attributed information and numeric information. The TNG is an ideal data structure model for novel scientific discovery via graph re",
      "authors": "Haoran Song; Jiarui Feng; Guangfu Li; Michael Province; Philip Payne",
      "date": "2025-01-21",
      "year": "2025",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2501.08187v2",
      "doi": "",
      "title": "A Multi-Modal AI Copilot for Single-Cell Analysis with Instruction Following",
      "abstract": "Large language models excel at interpreting complex natural language instructions, enabling them to perform a wide range of tasks. In the life sciences, single-cell RNA sequencing (scRNA-seq) data serves as the \"language of cellular biology\", capturing intricate gene expression patterns at the single-cell level. However, interacting with this \"language\" through conventional tools is often inefficient and unintuitive, posing challenges for researchers. To address these limitations, we present Ins",
      "authors": "Yin Fang; Xinle Deng; Kangwei Liu; Ningyu Zhang; Jingyang Qian",
      "date": "2025-01-14",
      "year": "2025",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.CE",
        "cs.HC",
        "cs.LG",
        "q-bio.CB"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2412.19191v2",
      "doi": "",
      "title": "Biology-Instructions: A Dataset and Benchmark for Multi-Omics Sequence Understanding Capability of Large Language Models",
      "abstract": "Large language models (LLMs) have shown remarkable capabilities in general domains, but their application to multi-omics biology remains underexplored. To address this gap, we introduce Biology-Instructions, the first large-scale instruction-tuning dataset for multi-omics biological sequences, including DNA, RNA, proteins, and multi-molecules. This dataset bridges LLMs and complex biological sequence-related tasks, enhancing their versatility and reasoning while maintaining conversational fluenc",
      "authors": "Haonan He; Yuchen Ren; Yining Tang; Ziyang Xu; Junxian Li",
      "date": "2024-12-26",
      "year": "2024",
      "categories": [
        "q-bio.BM",
        "cs.AI",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2412.18156v1",
      "doi": "",
      "title": "scReader: Prompting Large Language Models to Interpret scRNA-seq Data",
      "abstract": "Large language models (LLMs) have demonstrated remarkable advancements, primarily due to their capabilities in modeling the hidden relationships within text sequences. This innovation presents a unique opportunity in the field of life sciences, where vast collections of single-cell omics data from multiple species provide a foundation for training foundational models. However, the challenge lies in the disparity of data scales across different species, hindering the development of a comprehensiv",
      "authors": "Cong Li; Qingqing Long; Yuanchun Zhou; Meng Xiao",
      "date": "2024-12-24",
      "year": "2024",
      "categories": [
        "q-bio.GN",
        "cs.AI",
        "cs.CL"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2412.15790v1",
      "doi": "",
      "title": "GraphSeqLM: A Unified Graph Language Framework for Omic Graph Learning",
      "abstract": "The integration of multi-omic data is pivotal for understanding complex diseases, but its high dimensionality and noise present significant challenges. Graph Neural Networks (GNNs) offer a robust framework for analyzing large-scale signaling pathways and protein-protein interaction networks, yet they face limitations in expressivity when capturing intricate biological relationships. To address this, we propose Graph Sequence Language Model (GraphSeqLM), a framework that enhances GNNs with biolog",
      "authors": "Heming Zhang; Di Huang; Yixin Chen; Fuhai Li",
      "date": "2024-12-20",
      "year": "2024",
      "categories": [
        "q-bio.QM",
        "cs.AI",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2412.10659v1",
      "doi": "",
      "title": "MEATRD: Multimodal Anomalous Tissue Region Detection Enhanced with Spatial Transcriptomics",
      "abstract": "The detection of anomalous tissue regions (ATRs) within affected tissues is crucial in clinical diagnosis and pathological studies. Conventional automated ATR detection methods, primarily based on histology images alone, falter in cases where ATRs and normal tissues have subtle visual differences. The recent spatial transcriptomics (ST) technology profiles gene expressions across tissue regions, offering a molecular perspective for detecting ATRs. However, there is a dearth of ATR detection meth",
      "authors": "Kaichen Xu; Qilong Wu; Yan Lu; Yinan Zheng; Wenlin Li",
      "date": "2024-12-14",
      "year": "2024",
      "categories": [
        "cs.CV",
        "cs.LG",
        "q-bio.QM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2412.07136v1",
      "doi": "",
      "title": "A multimodal ensemble approach for clear cell renal cell carcinoma treatment outcome prediction",
      "abstract": "Purpose: A reliable cancer prognosis model for clear cell renal cell carcinoma (ccRCC) can enhance personalized treatment. We developed a multi-modal ensemble model (MMEM) that integrates pretreatment clinical data, multi-omics data, and histopathology whole slide image (WSI) data to predict overall survival (OS) and disease-free survival (DFS) for ccRCC patients. Methods: We analyzed 226 patients from The Cancer Genome Atlas Kidney Renal Clear Cell Carcinoma (TCGA-KIRC) dataset, which includes ",
      "authors": "Meixu Chen; Kai Wang; Payal Kapur; James Brugarolas; Raquibul Hannan",
      "date": "2024-12-10",
      "year": "2024",
      "categories": [
        "cs.CV",
        "q-bio.QM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2412.02915v1",
      "doi": "",
      "title": "Single-Cell Omics Arena: A Benchmark Study for Large Language Models on Cell Type Annotation Using Single-Cell Data",
      "abstract": "Over the past decade, the revolution in single-cell sequencing has enabled the simultaneous molecular profiling of various modalities across thousands of individual cells, allowing scientists to investigate the diverse functions of complex tissues and uncover underlying disease mechanisms. Among all the analytical steps, assigning individual cells to specific types is fundamental for understanding cellular heterogeneity. However, this process is usually labor-intensive and requires extensive exp",
      "authors": "Junhao Liu; Siwei Xu; Lei Zhang; Jing Zhang",
      "date": "2024-12-03",
      "year": "2024",
      "categories": [
        "cs.CL",
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2412.12112v2",
      "doi": "",
      "title": "Generative Modeling of Neural Dynamics via Latent Stochastic Differential Equations",
      "abstract": "We propose a probabilistic framework for developing computational models of biological neural systems. In this framework, physiological recordings are viewed as discrete-time partial observations of an underlying continuous-time stochastic dynamical system which implements computations through its state evolution. To model this dynamical system, we employ a system of coupled stochastic differential equations with differentiable drift and diffusion functions and use variational inference to infer",
      "authors": "Ahmed ElGazzar; Marcel van Gerven",
      "date": "2024-12-01",
      "year": "2024",
      "categories": [
        "q-bio.NC",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2411.16793v1",
      "doi": "",
      "title": "ST-Align: A Multimodal Foundation Model for Image-Gene Alignment in Spatial Transcriptomics",
      "abstract": "Spatial transcriptomics (ST) provides high-resolution pathological images and whole-transcriptomic expression profiles at individual spots across whole-slide scales. This setting makes it an ideal data source to develop multimodal foundation models. Although recent studies attempted to fine-tune visual encoders with trainable gene encoders based on spot-level, the absence of a wider slide perspective and spatial intrinsic relationships limits their ability to capture ST-specific insights effecti",
      "authors": "Yuxiang Lin; Ling Luo; Ying Chen; Xushi Zhang; Zihui Wang",
      "date": "2024-11-25",
      "year": "2024",
      "categories": [
        "cs.CV",
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2411.15076v2",
      "doi": "",
      "title": "RankByGene: Gene-Guided Histopathology Representation Learning Through Cross-Modal Ranking Consistency",
      "abstract": "Spatial transcriptomics (ST) provides essential spatial context by mapping gene expression within tissue, enabling detailed study of cellular heterogeneity and tissue organization. However, aligning ST data with histology images poses challenges due to inherent spatial distortions and modality-specific variations. Existing methods largely rely on direct alignment, which often fails to capture complex cross-modal relationships. To address these limitations, we propose a novel framework that align",
      "authors": "Wentao Huang; Meilong Xu; Xiaoling Hu; Shahira Abousamra; Aniruddha Ganguly",
      "date": "2024-11-22",
      "year": "2024",
      "categories": [
        "eess.IV",
        "cs.CV",
        "q-bio.QM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2411.03743v1",
      "doi": "",
      "title": "Automating Exploratory Proteomics Research via Language Models",
      "abstract": "With the development of artificial intelligence, its contribution to science is evolving from simulating a complex problem to automating entire research processes and producing novel discoveries. Achieving this advancement requires both specialized general models grounded in real-world scientific data and iterative, exploratory frameworks that mirror human scientific methodologies. In this paper, we present PROTEUS, a fully automated system for scientific discovery from raw proteomics data. PROT",
      "authors": "Ning Ding; Shang Qu; Linhai Xie; Yifei Li; Zaoqu Liu",
      "date": "2024-11-06",
      "year": "2024",
      "categories": [
        "cs.AI",
        "q-bio.QM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2410.15828v1",
      "doi": "",
      "title": "LLM4GRN: Discovering Causal Gene Regulatory Networks with LLMs -- Evaluation through Synthetic Data Generation",
      "abstract": "Gene regulatory networks (GRNs) represent the causal relationships between transcription factors (TFs) and target genes in single-cell RNA sequencing (scRNA-seq) data. Understanding these networks is crucial for uncovering disease mechanisms and identifying therapeutic targets. In this work, we investigate the potential of large language models (LLMs) for GRN discovery, leveraging their learned biological knowledge alone or in combination with traditional statistical methods. We develop a task-b",
      "authors": "Tejumade Afonja; Ivaxi Sheth; Ruta Binkyte; Waqar Hanif; Thomas Ulas",
      "date": "2024-10-21",
      "year": "2024",
      "categories": [
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2410.11468v3",
      "doi": "",
      "title": "Can sparse autoencoders make sense of gene expression latent variable models?",
      "abstract": "Sparse autoencoders (SAEs) have lately been used to uncover interpretable latent features in large language models. By projecting dense embeddings into a much higher-dimensional and sparse space, learned features become disentangled and easier to interpret. This work explores the potential of SAEs for decomposing embeddings in complex and high-dimensional biological data. Using simulated data, it outlines the efficacy, hyperparameter landscape, and limitations of SAEs when it comes to extracting",
      "authors": "Viktoria Schuster",
      "date": "2024-10-15",
      "year": "2024",
      "categories": [
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2410.11281v2",
      "doi": "",
      "title": "DynaCLR: Contrastive Learning of Cellular Dynamics with Temporal Regularization",
      "abstract": "We report DynaCLR, a self-supervised method for embedding cell and organelle Dynamics via Contrastive Learning of Representations of time-lapse images. DynaCLR integrates single-cell tracking and time-aware contrastive sampling to learn robust, temporally regularized representations of cell dynamics. DynaCLR embeddings generalize effectively to in-distribution and out-of-distribution datasets, and can be used for several downstream tasks with sparse human annotations. We demonstrate efficient an",
      "authors": "Eduardo Hirata-Miyasaki; Soorya Pradeep; Ziwen Liu; Alishba Imran; Taylla Milena Theodoro",
      "date": "2024-10-15",
      "year": "2024",
      "categories": [
        "cs.CV",
        "q-bio.QM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2410.05292v1",
      "doi": "",
      "title": "CaLMFlow: Volterra Flow Matching using Causal Language Models",
      "abstract": "We introduce CaLMFlow (Causal Language Models for Flow Matching), a novel framework that casts flow matching as a Volterra integral equation (VIE), leveraging the power of large language models (LLMs) for continuous data generation. CaLMFlow enables the direct application of LLMs to learn complex flows by formulating flow matching as a sequence modeling task, bridging discrete language modeling and continuous generative modeling. Our method implements tokenization across space and time, thereby ",
      "authors": "Sizhuang He; Daniel Levine; Ivan Vrkic; Marco Francesco Bressana; David Zhang",
      "date": "2024-10-03",
      "year": "2024",
      "categories": [
        "cs.LG",
        "cs.AI",
        "q-bio.QM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2410.01858v1",
      "doi": "",
      "title": "Long-range gene expression prediction with token alignment of large language model",
      "abstract": "Gene expression is a cellular process that plays a fundamental role in human phenotypical variations and diseases. Despite advances of deep learning models for gene expression prediction, recent benchmarks have revealed their inability to learn distal regulatory grammar. Here, we address this challenge by leveraging a pretrained large language model to enhance gene expression prediction. We introduce Genetic sequence Token Alignment (GTA), which aligns genetic sequence features with natural lang",
      "authors": "Edouardo Honig; Huixin Zhan; Ying Nian Wu; Zijun Frank Zhang",
      "date": "2024-10-02",
      "year": "2024",
      "categories": [
        "q-bio.CB",
        "cs.LG",
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2409.10502v1",
      "doi": "",
      "title": "Causal Language Modeling Can Elicit Search and Reasoning Capabilities on Logic Puzzles",
      "abstract": "Causal language modeling using the Transformer architecture has yielded remarkable capabilities in Large Language Models (LLMs) over the last few years. However, the extent to which fundamental search and reasoning capabilities emerged within LLMs remains a topic of ongoing debate. In this work, we study if causal language modeling can learn a complex task such as solving Sudoku puzzles. To solve a Sudoku, the model is first required to search over all empty cells of the puzzle to decide on a ce",
      "authors": "Kulin Shah; Nishanth Dikkala; Xin Wang; Rina Panigrahy",
      "date": "2024-09-16",
      "year": "2024",
      "categories": [
        "cs.LG",
        "cs.CL"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2409.02732v1",
      "doi": "",
      "title": "Approximating mutual information of high-dimensional variables using learned representations",
      "abstract": "Mutual information (MI) is a general measure of statistical dependence with widespread application across the sciences. However, estimating MI between multi-dimensional variables is challenging because the number of samples necessary to converge to an accurate estimate scales unfavorably with dimensionality. In practice, existing techniques can reliably estimate MI in up to tens of dimensions, but fail in higher dimensions, where sufficient sample sizes are infeasible. Here, we explore the idea ",
      "authors": "Gokul Gowri; Xiao-Kang Lun; Allon M. Klein; Peng Yin",
      "date": "2024-09-03",
      "year": "2024",
      "categories": [
        "q-bio.QM",
        "cs.IT",
        "stat.ML"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2408.16245v6",
      "doi": "",
      "title": "Large-Scale Multi-omic Biosequence Transformers for Modeling Protein-Nucleic Acid Interactions",
      "abstract": "The transformer architecture has revolutionized bioinformatics and driven progress in the understanding and prediction of the properties of biomolecules. To date, most biosequence transformers have been trained on single-omic data - either proteins or nucleic acids - and have seen incredible success in downstream tasks in each domain, with particularly noteworthy breakthroughs in protein structural modeling. However, single-omic pretraining limits the ability of these models to capture cross-mod",
      "authors": "Sully F. Chen; Robert J. Steele; Glen M. Hocky; Beakal Lemeneh; Shivanand P. Lad",
      "date": "2024-08-29",
      "year": "2024",
      "categories": [
        "cs.LG",
        "q-bio.BM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2407.19030v4",
      "doi": "",
      "title": "Multimodal data integration and cross-modal querying via orchestrated approximate message passing",
      "abstract": "The need for multimodal data integration arises naturally when multiple complementary sets of features are measured on the same sample. Under a dependent multifactor model, we develop a fully data-driven orchestrated approximate message passing algorithm for integrating information across these feature sets to achieve statistically optimal signal recovery. In practice, these reference data sets are often queried later by new subjects that are only partially observed. Leveraging on asymptotic nor",
      "authors": "Sagnik Nandy; Zongming Ma",
      "date": "2024-07-26",
      "year": "2024",
      "categories": [
        "stat.ME",
        "math.ST"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2407.18181v1",
      "doi": "",
      "title": "Gene Regulatory Network Inference from Pre-trained Single-Cell Transcriptomics Transformer with Joint Graph Learning",
      "abstract": "Inferring gene regulatory networks (GRNs) from single-cell RNA sequencing (scRNA-seq) data is a complex challenge that requires capturing the intricate relationships between genes and their regulatory interactions. In this study, we tackle this challenge by leveraging the single-cell BERT-based pre-trained transformer model (scBERT), trained on extensive unlabeled scRNA-seq data, to augment structured biological knowledge from existing GRNs. We introduce a novel joint graph learning approach tha",
      "authors": "Sindhura Kommu; Yizhi Wang; Yue Wang; Xuan Wang",
      "date": "2024-07-25",
      "year": "2024",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2407.13205v1",
      "doi": "",
      "title": "Transformer-based Single-Cell Language Model: A Survey",
      "abstract": "The transformers have achieved significant accomplishments in the natural language processing as its outstanding parallel processing capabilities and highly flexible attention mechanism. In addition, increasing studies based on transformers have been proposed to model single-cell data. In this review, we attempt to systematically summarize the single-cell language models and applications based on transformers. First, we provide a detailed introduction about the structure and principles of transf",
      "authors": "Wei Lan; Guohang He; Mingyang Liu; Qingfeng Chen; Junyue Cao",
      "date": "2024-07-18",
      "year": "2024",
      "categories": [
        "cs.CL"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2407.11734v2",
      "doi": "",
      "title": "Multi-Modal and Multi-Attribute Generation of Single Cells with CFGen",
      "abstract": "Generative modeling of single-cell RNA-seq data is crucial for tasks like trajectory inference, batch effect removal, and simulation of realistic cellular data. However, recent deep generative models simulating synthetic single cells from noise operate on pre-processed continuous gene expression approximations, overlooking the discrete nature of single-cell data, which limits their effectiveness and hinders the incorporation of robust noise models. Additionally, aspects like controllable multi-m",
      "authors": "Alessandro Palma; Till Richter; Hanyi Zhang; Manuel Lubetzki; Alexander Tong",
      "date": "2024-07-16",
      "year": "2024",
      "categories": [
        "q-bio.QM",
        "cs.LG",
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2407.09811v1",
      "doi": "",
      "title": "CellAgent: An LLM-driven Multi-Agent Framework for Automated Single-cell Data Analysis",
      "abstract": "Single-cell RNA sequencing (scRNA-seq) data analysis is crucial for biological research, as it enables the precise characterization of cellular heterogeneity. However, manual manipulation of various tools to achieve desired outcomes can be labor-intensive for researchers. To address this, we introduce CellAgent (http://cell.agent4science.cn/), an LLM-driven multi-agent framework, specifically designed for the automatic processing and execution of scRNA-seq data analysis tasks, providing high-qua",
      "authors": "Yihang Xiao; Jinyi Liu; Yan Zheng; Xiaohan Xie; Jianye Hao",
      "date": "2024-07-13",
      "year": "2024",
      "categories": [
        "cs.AI",
        "cs.HC",
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2407.09089v1",
      "doi": "",
      "title": "Lomics: Generation of Pathways and Gene Sets using Large Language Models for Transcriptomic Analysis",
      "abstract": "Interrogation of biological pathways is an integral part of omics data analysis. Large language models (LLMs) enable the generation of custom pathways and gene sets tailored to specific scientific questions. These targeted sets are significantly smaller than traditional pathway enrichment analysis libraries, reducing multiple hypothesis testing and potentially enhancing statistical power. Lomics (Large Language Models for Omics Studies) v1.0 is a python-based bioinformatics toolkit that streamli",
      "authors": "Chun-Ka Wong; Ali Choo; Eugene C. C. Cheng; Wing-Chun San; Kelvin Chak-Kong Cheng",
      "date": "2024-07-12",
      "year": "2024",
      "categories": [
        "q-bio.MN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2407.08216v1",
      "doi": "",
      "title": "Multimodal contrastive learning for spatial gene expression prediction using histology images",
      "abstract": "In recent years, the advent of spatial transcriptomics (ST) technology has unlocked unprecedented opportunities for delving into the complexities of gene expression patterns within intricate biological systems. Despite its transformative potential, the prohibitive cost of ST technology remains a significant barrier to its widespread adoption in large-scale studies. An alternative, more cost-effective strategy involves employing artificial intelligence to predict gene expression levels using read",
      "authors": "Wenwen Min; Zhiceng Shi; Jun Zhang; Jun Wan; Changmiao Wang",
      "date": "2024-07-11",
      "year": "2024",
      "categories": [
        "eess.IV",
        "cs.AI",
        "cs.CV",
        "q-bio.QM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2407.03381v1",
      "doi": "",
      "title": "SeqMate: A Novel Large Language Model Pipeline for Automating RNA Sequencing",
      "abstract": "RNA sequencing techniques, like bulk RNA-seq and Single Cell (sc) RNA-seq, are critical tools for the biologist looking to analyze the genetic activity/transcriptome of a tissue or cell during an experimental procedure. Platforms like Illumina's next-generation sequencing (NGS) are used to produce the raw data for this experimental procedure. This raw FASTQ data must then be prepared via a complex series of data manipulations by bioinformaticians. This process currently takes place on an unwield",
      "authors": "Devam Mondal; Atharva Inamdar",
      "date": "2024-07-02",
      "year": "2024",
      "categories": [
        "q-bio.GN",
        "cs.AI",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2406.15534v1",
      "doi": "",
      "title": "Geneverse: A collection of Open-source Multimodal Large Language Models for Genomic and Proteomic Research",
      "abstract": "The applications of large language models (LLMs) are promising for biomedical and healthcare research. Despite the availability of open-source LLMs trained using a wide range of biomedical data, current research on the applications of LLMs to genomics and proteomics is still limited. To fill this gap, we propose a collection of finetuned LLMs and multimodal LLMs (MLLMs), known as Geneverse, for three novel tasks in genomic and proteomic research. The models in Geneverse are trained and evaluated",
      "authors": "Tianyu Liu; Yijia Xiao; Xiao Luo; Hua Xu; W. Jim Zheng",
      "date": "2024-06-21",
      "year": "2024",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.CL",
        "q-bio.QM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2406.14307v2",
      "doi": "",
      "title": "QuST-LLM: Integrating Large Language Models for Comprehensive Spatial Transcriptomics Analysis",
      "abstract": "In this paper, we introduce QuST-LLM, an innovative extension of QuPath that utilizes the capabilities of large language models (LLMs) to analyze and interpret spatial transcriptomics (ST) data. In addition to simplifying the intricate and high-dimensional nature of ST data by offering a comprehensive workflow that includes data loading, region selection, gene expression analysis, and functional annotation, QuST-LLM employs LLMs to transform complex ST data into understandable and detailed biolo",
      "authors": "Chao Hui Huang",
      "date": "2024-06-20",
      "year": "2024",
      "categories": [
        "q-bio.GN",
        "cs.CL",
        "cs.CV"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2405.18655v1",
      "doi": "",
      "title": "CAVACHON: a hierarchical variational autoencoder to integrate multi-modal single-cell data",
      "abstract": "Paired single-cell sequencing technologies enable the simultaneous measurement of complementary modalities of molecular data at single-cell resolution. Along with the advances in these technologies, many methods based on variational autoencoders have been developed to integrate these data. However, these methods do not explicitly incorporate prior biological relationships between the data modalities, which could significantly enhance modeling and interpretation. We propose a novel probabilistic ",
      "authors": "Ping-Han Hsieh; Ru-Xiu Hsiao; Katalin Ferenc; Anthony Mathelier; Rebekka Burkholz",
      "date": "2024-05-28",
      "year": "2024",
      "categories": [
        "cs.LG",
        "cs.AI",
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2405.11280v1",
      "doi": "",
      "title": "Joint Analysis of Single-Cell Data across Cohorts with Missing Modalities",
      "abstract": "Joint analysis of multi-omic single-cell data across cohorts has significantly enhanced the comprehensive analysis of cellular processes. However, most of the existing approaches for this purpose require access to samples with complete modality availability, which is impractical in many real-world scenarios. In this paper, we propose (Single-Cell Cross-Cohort Cross-Category) integration, a novel framework that learns unified cell representations under domain shift without requiring full-modality",
      "authors": "Marianne Arriola; Weishen Pan; Manqi Zhou; Qiannan Zhang; Chang Su",
      "date": "2024-05-18",
      "year": "2024",
      "categories": [
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2403.11375v1",
      "doi": "",
      "title": "Path-GPTOmic: A Balanced Multi-modal Learning Framework for Survival Outcome Prediction",
      "abstract": "For predicting cancer survival outcomes, standard approaches in clinical research are often based on two main modalities: pathology images for observing cell morphology features, and genomic (e.g., bulk RNA-seq) for quantifying gene expressions. However, existing pathology-genomic multi-modal algorithms face significant challenges: (1) Valuable biological insights regarding genes and gene-gene interactions are frequently overlooked; (2) one modality often dominates the optimization process, caus",
      "authors": "Hongxiao Wang; Yang Yang; Zhuo Zhao; Pengfei Gu; Nishchal Sapkota",
      "date": "2024-03-18",
      "year": "2024",
      "categories": [
        "cs.CV",
        "cs.LG",
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2403.06338v1",
      "doi": "",
      "title": "Disentangling shared and private latent factors in multimodal Variational Autoencoders",
      "abstract": "Generative models for multimodal data permit the identification of latent factors that may be associated with important determinants of observed data heterogeneity. Common or shared factors could be important for explaining variation across modalities whereas other factors may be private and important only for the explanation of a single modality. Multimodal Variational Autoencoders, such as MVAE and MMVAE, are a natural choice for inferring those underlying latent factors and separating shared ",
      "authors": "Kaspar Märtens; Christopher Yau",
      "date": "2024-03-10",
      "year": "2024",
      "categories": [
        "stat.ML",
        "cs.LG",
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2402.12405v1",
      "doi": "",
      "title": "scInterpreter: Training Large Language Models to Interpret scRNA-seq Data for Cell Type Annotation",
      "abstract": "Despite the inherent limitations of existing Large Language Models in directly reading and interpreting single-cell omics data, they demonstrate significant potential and flexibility as the Foundation Model. This research focuses on how to train and adapt the Large Language Model with the capability to interpret and distinguish cell types in single-cell RNA sequencing data. Our preliminary research results indicate that these foundational models excel in accurately categorizing known cell types,",
      "authors": "Cong Li; Meng Xiao; Pengfei Wang; Guihai Feng; Xin Li",
      "date": "2024-02-18",
      "year": "2024",
      "categories": [
        "q-bio.GN",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2402.08303v4",
      "doi": "",
      "title": "ChatCell: Facilitating Single-Cell Analysis with Natural Language",
      "abstract": "As Large Language Models (LLMs) rapidly evolve, their influence in science is becoming increasingly prominent. The emerging capabilities of LLMs in task generalization and free-form dialogue can significantly advance fields like chemistry and biology. However, the field of single-cell biology, which forms the foundational building blocks of living organisms, still faces several challenges. High knowledge barriers and limited scalability in current methods restrict the full exploitation of LLMs i",
      "authors": "Yin Fang; Kangwei Liu; Ningyu Zhang; Xinle Deng; Penghui Yang",
      "date": "2024-02-13",
      "year": "2024",
      "categories": [
        "cs.CL",
        "cs.AI",
        "cs.CE",
        "cs.HC",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2401.14772v1",
      "doi": "",
      "title": "Spatial Transcriptomics Analysis of Zero-shot Gene Expression Prediction",
      "abstract": "Spatial transcriptomics (ST) captures gene expression within distinct regions (i.e., windows) of a tissue slide. Traditional supervised learning frameworks applied to model ST are constrained to predicting expression from slide image windows for gene types seen during training, failing to generalize to unseen gene types. To overcome this limitation, we propose a semantic guided network (SGN), a pioneering zero-shot framework for predicting gene expression from slide image windows. Considering a ",
      "authors": "Yan Yang; Md Zakir Hossain; Xuesong Li; Shafin Rahman; Eric Stone",
      "date": "2024-01-26",
      "year": "2024",
      "categories": [
        "cs.CV"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2401.07543v1",
      "doi": "",
      "title": "Must: Maximizing Latent Capacity of Spatial Transcriptomics Data",
      "abstract": "Spatial transcriptomics (ST) technologies have revolutionized the study of gene expression patterns in tissues by providing multimodality data in transcriptomic, spatial, and morphological, offering opportunities for understanding tissue biology beyond transcriptomics. However, we identify the modality bias phenomenon in ST data species, i.e., the inconsistent contribution of different modalities to the labels leads to a tendency for the analysis methods to retain the information of the dominant",
      "authors": "Zelin Zang; Liangyu Li; Yongjie Xu; Chenrui Duan; Kai Wang",
      "date": "2024-01-15",
      "year": "2024",
      "categories": [
        "cs.CE",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2401.04155v2",
      "doi": "",
      "title": "Advancing bioinformatics with large language models: components, applications and perspectives",
      "abstract": "Large language models (LLMs) are a class of artificial intelligence models based on deep learning, which have great performance in various tasks, especially in natural language processing (NLP). Large language models typically consist of artificial neural networks with numerous parameters, trained on large amounts of unlabeled input using self-supervised or semi-supervised learning. However, their potential for solving bioinformatics problems may even exceed their proficiency in modeling human l",
      "authors": "Jiajia Liu; Mengyuan Yang; Yankai Yu; Haixia Xu; Tiangang Wang",
      "date": "2024-01-08",
      "year": "2024",
      "categories": [
        "q-bio.QM",
        "cs.CL"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2310.02275v1",
      "doi": "",
      "title": "MuSe-GNN: Learning Unified Gene Representation From Multimodal Biological Graph Data",
      "abstract": "Discovering genes with similar functions across diverse biomedical contexts poses a significant challenge in gene representation learning due to data heterogeneity. In this study, we resolve this problem by introducing a novel model called Multimodal Similarity Learning Graph Neural Network, which combines Multimodal Machine Learning and Deep Graph Neural Networks to learn gene representations from single-cell sequencing and spatial transcriptomic data. Leveraging 82 training datasets from 10 ti",
      "authors": "Tianyu Liu; Yuge Wang; Rex Ying; Hongyu Zhao",
      "date": "2023-09-29",
      "year": "2023",
      "categories": [
        "cs.LG",
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2308.05864v2",
      "doi": "https://doi.org/10.1038/s41592-024-02233-6",
      "title": "The Multi-modality Cell Segmentation Challenge: Towards Universal Solutions",
      "abstract": "Cell segmentation is a critical step for quantitative single-cell analysis in microscopy images. Existing cell segmentation methods are often tailored to specific modalities or require manual interventions to specify hyper-parameters in different experimental settings. Here, we present a multi-modality cell segmentation benchmark, comprising over 1500 labeled images derived from more than 50 diverse biological experiments. The top participants developed a Transformer-based deep-learning algorith",
      "authors": "Jun Ma; Ronald Xie; Shamini Ayyadhury; Cheng Ge; Anubha Gupta",
      "date": "2023-08-10",
      "year": "2023",
      "categories": [
        "eess.IV",
        "cs.CV",
        "cs.LG",
        "q-bio.QM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2304.13084v1",
      "doi": "",
      "title": "Representing and extracting knowledge from single cell data",
      "abstract": "Single-cell analysis is currently one of the most high-resolution techniques to study biology. The large complex datasets that have been generated have spurred numerous developments in computational biology, in particular the use of advanced statistics and machine learning. This review attempts to explain the deeper theoretical concepts that underpin current state-of-the-art analysis methods. Single-cell analysis is covered from cell, through instruments, to current and upcoming models. A minimu",
      "authors": "Ionut Sebastian Mihai; Sarang Chafle; Johan Henriksson",
      "date": "2023-04-25",
      "year": "2023",
      "categories": [
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2303.00233v3",
      "doi": "https://doi.org/10.1145/3583780.3615061",
      "title": "Single-Cell Multimodal Prediction via Transformers",
      "abstract": "The recent development of multimodal single-cell technology has made the possibility of acquiring multiple omics data from individual cells, thereby enabling a deeper understanding of cellular states and dynamics. Nevertheless, the proliferation of multimodal single-cell data also introduces tremendous challenges in modeling the complex interactions among different modalities. The recently advanced methods focus on constructing static interaction graphs and applying graph neural networks (GNNs) ",
      "authors": "Wenzhuo Tang; Hongzhi Wen; Renming Liu; Jiayuan Ding; Wei Jin",
      "date": "2023-03-01",
      "year": "2023",
      "categories": [
        "q-bio.GN",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2302.10907v1",
      "doi": "",
      "title": "Diffusion Models in Bioinformatics: A New Wave of Deep Learning Revolution in Action",
      "abstract": "Denoising diffusion models have emerged as one of the most powerful generative models in recent years. They have achieved remarkable success in many fields, such as computer vision, natural language processing (NLP), and bioinformatics. Although there are a few excellent reviews on diffusion models and their applications in computer vision and NLP, there is a lack of an overview of their applications in bioinformatics. This review aims to provide a rather thorough overview of the applications of",
      "authors": "Zhiye Guo; Jian Liu; Yanli Wang; Mengrui Chen; Duolin Wang",
      "date": "2023-02-13",
      "year": "2023",
      "categories": [
        "cs.LG",
        "cs.AI",
        "q-bio.QM"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2211.02920v3",
      "doi": "",
      "title": "GmGM: a Fast Multi-Axis Gaussian Graphical Model",
      "abstract": "This paper introduces the Gaussian multi-Graphical Model, a model to construct sparse graph representations of matrix- and tensor-variate data. We generalize prior work in this area by simultaneously learning this representation across several tensors that share axes, which is necessary to allow the analysis of multimodal datasets such as those encountered in multi-omics. Our algorithm uses only a single eigendecomposition per axis, achieving an order of magnitude speedup over prior work in the ",
      "authors": "Bailey Andrew; David Westhead; Luisa Cutillo",
      "date": "2022-11-05",
      "year": "2022",
      "categories": [
        "stat.ML",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2210.14330v1",
      "doi": "",
      "title": "A single-cell gene expression language model",
      "abstract": "Gene regulation is a dynamic process that connects genotype and phenotype. Given the difficulty of physically mapping mammalian gene circuitry, we require new computational methods to learn regulatory rules. Natural language is a valuable analogy to the communication of regulatory control. Machine learning systems model natural language by explicitly learning context dependencies between words. We propose a similar system applied to single-cell RNA expression profiles to learn context dependenci",
      "authors": "William Connell; Umair Khan; Michael J. Keiser",
      "date": "2022-10-25",
      "year": "2022",
      "categories": [
        "q-bio.QM",
        "cs.AI",
        "q-bio.MN"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2203.01884v3",
      "doi": "https://doi.org/10.1145/3534678.3539213",
      "title": "Graph Neural Networks for Multimodal Single-Cell Data Integration",
      "abstract": "Recent advances in multimodal single-cell technologies have enabled simultaneous acquisitions of multiple omics data from the same cell, providing deeper insights into cellular states and dynamics. However, it is challenging to learn the joint representations from the multimodal data, model the relationship between modalities, and, more importantly, incorporate the vast amount of single-modality datasets into the downstream analyses. To address these challenges and correspondingly facilitate mul",
      "authors": "Hongzhi Wen; Jiayuan Ding; Wei Jin; Yiqi Wang; Yuying Xie",
      "date": "2022-03-03",
      "year": "2022",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2102.06757v3",
      "doi": "",
      "title": "Multimodal Data Visualization and Denoising with Integrated Diffusion",
      "abstract": "We propose a method called integrated diffusion for combining multimodal datasets, or data gathered via several different measurements on the same system, to create a joint data diffusion operator. As real world data suffers from both local and global noise, we introduce mechanisms to optimally calculate a diffusion operator that reflects the combined information from both modalities. We show the utility of this joint operator in data denoising, visualization and clustering, performing better th",
      "authors": "Manik Kuchroo; Abhinav Godavarthi; Alexander Tong; Guy Wolf; Smita Krishnaswamy",
      "date": "2021-02-12",
      "year": "2021",
      "categories": [
        "cs.LG",
        "cs.HC"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2012.00933v3",
      "doi": "",
      "title": "Global and Individualized Community Detection in Inhomogeneous Multilayer Networks",
      "abstract": "In network applications, it has become increasingly common to obtain datasets in the form of multiple networks observed on the same set of subjects, where each network is obtained in a related but different experiment condition or application scenario. Such datasets can be modeled by multilayer networks where each layer is a separate network itself while different layers are associated and share some common information. The present paper studies community detection in a stylized yet informative ",
      "authors": "Shuxiao Chen; Sifan Liu; Zongming Ma",
      "date": "2020-12-02",
      "year": "2020",
      "categories": [
        "math.ST",
        "cs.IT",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2005.03994v1",
      "doi": "",
      "title": "Cell Type Identification from Single-Cell Transcriptomic Data via Semi-supervised Learning",
      "abstract": "Cell type identification from single-cell transcriptomic data is a common goal of single-cell RNA sequencing (scRNAseq) data analysis. Neural networks have been employed to identify cell types from scRNAseq data with high performance. However, it requires a large mount of individual cells with accurate and unbiased annotated types to build the identification models. Unfortunately, labeling the scRNAseq data is cumbersome and time-consuming as it involves manual inspection of marker genes. To ove",
      "authors": "Xishuang Dong; Shanta Chowdhury; Uboho Victor; Xiangfang Li; Lijun Qian",
      "date": "2020-05-06",
      "year": "2020",
      "categories": [
        "q-bio.GN",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2003.12773v1",
      "doi": "",
      "title": "Knowledge synthesis from 100 million biomedical documents augments the deep expression profiling of coronavirus receptors",
      "abstract": "The COVID-19 pandemic demands assimilation of all available biomedical knowledge to decode its mechanisms of pathogenicity and transmission. Despite the recent renaissance in unsupervised neural networks for decoding unstructured natural languages, a platform for the real-time synthesis of the exponentially growing biomedical literature and its comprehensive triangulation with deep omic insights is not available. Here, we present the nferX platform for dynamic inference from over 45 quadrillion ",
      "authors": "AJ Venkatakrishnan; Arjun Puranik; Akash Anand; David Zemmour; Xiang Yao",
      "date": "2020-03-28",
      "year": "2020",
      "categories": [
        "q-bio.GN",
        "cs.IR",
        "q-bio.BM",
        "q-bio.TO"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "1910.07763v3",
      "doi": "",
      "title": "Mixture-of-Experts Variational Autoencoder for Clustering and Generating from Similarity-Based Representations on Single Cell Data",
      "abstract": "Clustering high-dimensional data, such as images or biological measurements, is a long-standingproblem and has been studied extensively. Recently, Deep Clustering has gained popularity due toits flexibility in fitting the specific peculiarities of complex data. Here we introduce the Mixture-of-Experts Similarity Variational Autoencoder (MoE-Sim-VAE), a novel generative clustering model.The model can learn multi-modal distributions of high-dimensional data and use these to generaterealistic data ",
      "authors": "Andreas Kopf; Vincent Fortuin; Vignesh Ram Somnath; Manfred Claassen",
      "date": "2019-10-17",
      "year": "2019",
      "categories": [
        "cs.LG",
        "stat.ML"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "1908.10925v1",
      "doi": "",
      "title": "Multimodal Neuroimaging Data Integration and Pathway Analysis",
      "abstract": "With fast advancements in technologies, the collection of multiple types of measurements on a common set of subjects is becoming routine in science. Some notable examples include multimodal neuroimaging studies for the simultaneous investigation of brain structure and function, and multi-omics studies for combining genetic and genomic information. Integrative analysis of multimodal data allows scientists to interrogate new mechanistic questions. However, the data collection and generation of int",
      "authors": "Yi Zhao; Lexin Li; Brian S. Caffo",
      "date": "2019-08-28",
      "year": "2019",
      "categories": [
        "stat.ME"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "1906.05226v1",
      "doi": "",
      "title": "Continual and Multi-Task Architecture Search",
      "abstract": "Architecture search is the process of automatically learning the neural model or cell structure that best suits the given task. Recently, this approach has shown promising performance improvements (on language modeling and image classification) with reasonable training speed, using a weight sharing strategy called Efficient Neural Architecture Search (ENAS). In our work, we first introduce a novel continual architecture search (CAS) approach, so as to continually evolve the model parameters duri",
      "authors": "Ramakanth Pasunuru; Mohit Bansal",
      "date": "2019-06-12",
      "year": "2019",
      "categories": [
        "cs.CL",
        "cs.CV",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "1903.10536v2",
      "doi": "https://doi.org/10.1371/journal.pone.0224446",
      "title": "Gene Expression based Survival Prediction for Cancer Patients: A Topic Modeling Approach",
      "abstract": "Cancer is one of the leading cause of death, worldwide. Many believe that genomic data will enable us to better predict the survival time of these patients, which will lead to better, more personalized treatment options and patient care. As standard survival prediction models have a hard time coping with the high-dimensionality of such gene expression (GE) data, many projects use some dimensionality reduction techniques to overcome this hurdle. We introduce a novel methodology, inspired by topic",
      "authors": "Luke Kumar; Russell Greiner",
      "date": "2019-03-25",
      "year": "2019",
      "categories": [
        "cs.LG",
        "stat.ML"
      ],
      "source": "arxiv",
      "found_by_query": "primary"
    },
    {
      "arxiv_id": "2601.10581v1",
      "doi": "",
      "title": "From Single to Multi-Agent Reasoning: Advancing GeneGPT for Genomics QA",
      "abstract": "Comprehending genomic information is essential for biomedical research, yet extracting data from complex distributed databases remains challenging. Large language models (LLMs) offer potential for genomic Question Answering (QA) but face limitations due to restricted access to domain-specific databases. GeneGPT is the current state-of-the-art system that enhances LLMs by utilizing specialized API calls, though it is constrained by rigid API dependencies and limited adaptability. We replicate Gen",
      "authors": "Kimia Abedini; Farzad Shami; Gianmaria Silvello",
      "date": "2026-01-15",
      "year": "2026",
      "categories": [
        "cs.AI",
        "cs.IR"
      ],
      "source": "arxiv",
      "found_by_query": "model_names"
    },
    {
      "arxiv_id": "2511.15061v1",
      "doi": "https://doi.org/10.1145/3767695.3769488",
      "title": "Beyond GeneGPT: A Multi-Agent Architecture with Open-Source LLMs for Enhanced Genomic Question Answering",
      "abstract": "Genomic question answering often requires complex reasoning and integration across diverse biomedical sources. GeneGPT addressed this challenge by combining domain-specific APIs with OpenAI's code-davinci-002 large language model to enable natural language interaction with genomic databases. However, its reliance on a proprietary model limits scalability, increases operational costs, and raises concerns about data privacy and generalization.   In this work, we revisit and reproduce GeneGPT in a ",
      "authors": "Haodong Chen; Guido Zuccon; Teerapong Leelanupab",
      "date": "2025-11-19",
      "year": "2025",
      "categories": [
        "cs.AI",
        "cs.IR",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "model_names"
    },
    {
      "arxiv_id": "2405.06708v5",
      "doi": "",
      "title": "LangCell: Language-Cell Pre-training for Cell Identity Understanding",
      "abstract": "Cell identity encompasses various semantic aspects of a cell, including cell type, pathway information, disease information, and more, which are essential for biologists to gain insights into its biological characteristics. Understanding cell identity from the transcriptomic data, such as annotating cell types, has become an important task in bioinformatics. As these semantic aspects are determined by human experts, it is impossible for AI models to effectively carry out cell identity understand",
      "authors": "Suyuan Zhao; Jiahuan Zhang; Yushuai Wu; Yizhen Luo; Zaiqing Nie",
      "date": "2024-05-09",
      "year": "2024",
      "categories": [
        "q-bio.GN",
        "cs.AI",
        "cs.CL"
      ],
      "source": "arxiv",
      "found_by_query": "model_names"
    },
    {
      "arxiv_id": "2403.03459v1",
      "doi": "",
      "title": "TGPT-PINN: Nonlinear model reduction with transformed GPT-PINNs",
      "abstract": "We introduce the Transformed Generative Pre-Trained Physics-Informed Neural Networks (TGPT-PINN) for accomplishing nonlinear model order reduction (MOR) of transport-dominated partial differential equations in an MOR-integrating PINNs framework. Building on the recent development of the GPT-PINN that is a network-of-networks design achieving snapshot-based model reduction, we design and test a novel paradigm for nonlinear model reduction that can effectively tackle problems with parameter-depend",
      "authors": "Yanlai Chen; Yajie Ji; Akil Narayan; Zhenli Xu",
      "date": "2024-03-06",
      "year": "2024",
      "categories": [
        "math.NA",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "model_names"
    },
    {
      "arxiv_id": "2304.09667v3",
      "doi": "https://doi.org/10.1093/bioinformatics/btae075",
      "title": "GeneGPT: Augmenting Large Language Models with Domain Tools for Improved Access to Biomedical Information",
      "abstract": "While large language models (LLMs) have been successfully applied to various tasks, they still face challenges with hallucinations. Augmenting LLMs with domain-specific tools such as database utilities can facilitate easier and more precise access to specialized knowledge. In this paper, we present GeneGPT, a novel method for teaching LLMs to use the Web APIs of the National Center for Biotechnology Information (NCBI) for answering genomics questions. Specifically, we prompt Codex to solve the G",
      "authors": "Qiao Jin; Yifan Yang; Qingyu Chen; Zhiyong Lu",
      "date": "2023-04-19",
      "year": "2023",
      "categories": [
        "cs.CL",
        "cs.AI",
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "model_names"
    },
    {
      "arxiv_id": "2511.05810v2",
      "doi": "",
      "title": "DiagnoLLM: A Hybrid Bayesian Neural Language Framework for Interpretable Disease Diagnosis",
      "abstract": "Building trustworthy clinical AI systems requires not only accurate predictions but also transparent, biologically grounded explanations. We present \\texttt{DiagnoLLM}, a hybrid framework that integrates Bayesian deconvolution, eQTL-guided deep learning, and LLM-based narrative generation for interpretable disease diagnosis. DiagnoLLM begins with GP-unmix, a Gaussian Process-based hierarchical model that infers cell-type-specific gene expression profiles from bulk and single-cell RNA-seq data wh",
      "authors": "Bowen Xu; Xinyue Zeng; Jiazhen Hu; Tuo Wang; Adithya Kulkarni",
      "date": "2025-11-08",
      "year": "2025",
      "categories": [
        "cs.AI",
        "cs.CL",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "bio_llm"
    },
    {
      "arxiv_id": "2508.08331v2",
      "doi": "",
      "title": "miRKatAI: An Integrated Database and Multi-agent AI system for microRNA Research",
      "abstract": "MicroRNAs (miRs) are robust regulators of gene expression, implicated in most biological processes. microRNAs predominantly downregulate the expression of genes post-transcriptionally and each miR is predicted to target several hundred genes. The accurate identification and annotation of miR-mRNA target interactions is central to understanding miRs function and their therapeutic potential. However, computational target prediction is challenging due to imperfect complementarity of miRs with their",
      "authors": "Karen Guerrero-Vazquez; Jacopo Umberto Verga; Pilib O Broin; Eva Szegezdi; Katarzyna Goljanek-Whysall",
      "date": "2025-08-10",
      "year": "2025",
      "categories": [
        "q-bio.GN",
        "cs.MA"
      ],
      "source": "arxiv",
      "found_by_query": "bio_llm"
    },
    {
      "arxiv_id": "2505.17257v4",
      "doi": "",
      "title": "JanusDNA: A Powerful Bi-directional Hybrid DNA Foundation Model",
      "abstract": "Large language models (LLMs) have revolutionized natural language processing and are increasingly applied to other sequential data types, including genetic sequences. However, adapting LLMs to genomics presents significant challenges. Capturing complex genomic interactions requires modeling long-range dependencies within DNA sequences, where interactions often span over 10,000 base pairs, even within a single gene, posing substantial computational burdens under conventional model architectures a",
      "authors": "Qihao Duan; Bingding Huang; Zhenqiao Song; Irina Lehmann; Lei Gu",
      "date": "2025-05-22",
      "year": "2025",
      "categories": [
        "cs.LG",
        "q-bio.GN"
      ],
      "source": "arxiv",
      "found_by_query": "bio_llm"
    },
    {
      "arxiv_id": "2505.15747v2",
      "doi": "https://doi.org/10.1109/ACCESS.2025.3582853",
      "title": "Multi-modal Integration Analysis of Alzheimer's Disease Using Large Language Models and Knowledge Graphs",
      "abstract": "We propose a novel framework for integrating fragmented multi-modal data in Alzheimer's disease (AD) research using large language models (LLMs) and knowledge graphs. While traditional multimodal analysis requires matched patient IDs across datasets, our approach demonstrates population-level integration of MRI, gene expression, biomarkers, EEG, and clinical indicators from independent cohorts. Statistical analysis identified significant features in each modality, which were connected as nodes i",
      "authors": "Kanan Kiguchi; Yunhao Tu; Katsuhiro Ajito; Fady Alnajjar; Kazuyuki Murase",
      "date": "2025-05-21",
      "year": "2025",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "bio_llm"
    },
    {
      "arxiv_id": "2410.22657v1",
      "doi": "",
      "title": "Automatic programming via large language models with population self-evolution for dynamic job shop scheduling problem",
      "abstract": "Heuristic dispatching rules (HDRs) are widely regarded as effective methods for solving dynamic job shop scheduling problems (DJSSP) in real-world production environments. However, their performance is highly scenario-dependent, often requiring expert customization. To address this, genetic programming (GP) and gene expression programming (GEP) have been extensively used for automatic algorithm design. Nevertheless, these approaches often face challenges due to high randomness in the search proc",
      "authors": "Jin Huang; Xinyu Li; Liang Gao; Qihao Liu; Yue Teng",
      "date": "2024-10-30",
      "year": "2024",
      "categories": [
        "cs.NE"
      ],
      "source": "arxiv",
      "found_by_query": "bio_llm"
    },
    {
      "arxiv_id": "2409.13537v1",
      "doi": "",
      "title": "ShizishanGPT: An Agricultural Large Language Model Integrating Tools and Resources",
      "abstract": "Recent developments in large language models (LLMs) have led to significant improvements in intelligent dialogue systems'ability to handle complex inquiries. However, current LLMs still exhibit limitations in specialized domain knowledge, particularly in technical fields such as agriculture. To address this problem, we propose ShizishanGPT, an intelligent question answering system for agriculture based on the Retrieval Augmented Generation (RAG) framework and agent architecture. ShizishanGPT con",
      "authors": "Shuting Yang; Zehui Liu; Wolfgang Mayer",
      "date": "2024-09-20",
      "year": "2024",
      "categories": [
        "cs.CL",
        "cs.AI"
      ],
      "source": "arxiv",
      "found_by_query": "bio_llm"
    },
    {
      "arxiv_id": "2405.03726v1",
      "doi": "",
      "title": "sc-OTGM: Single-Cell Perturbation Modeling by Solving Optimal Mass Transport on the Manifold of Gaussian Mixtures",
      "abstract": "Influenced by breakthroughs in LLMs, single-cell foundation models are emerging. While these models show successful performance in cell type clustering, phenotype classification, and gene perturbation response prediction, it remains to be seen if a simpler model could achieve comparable or better results, especially with limited data. This is important, as the quantity and quality of single-cell data typically fall short of the standards in textual data used for training LLMs. Single-cell sequen",
      "authors": "Andac Demir; Elizaveta Solovyeva; James Boylan; Mei Xiao; Fabrizio Serluca",
      "date": "2024-05-06",
      "year": "2024",
      "categories": [
        "q-bio.GN",
        "cs.LG"
      ],
      "source": "arxiv",
      "found_by_query": "bio_llm"
    }
  ]
}